like 262
got 185
legit 132
know 129
wake 112
yeah 109
wanna 99
come 96
ya 94
way 93
yo 93
nigga 89
love 87
let 85
hey 80
girl 79
ai 77
man 76
oh 75
run 69
niggas 68
shit 68
quit 65
gon 62
time 62
ta 61
huh 60
bump 58
pumps 57
right 55
uh 53
na 52
said 52
ooh 51
fire 49
fuck 49
better 48
bone 48
poo 48
day 47
live 47
real 47
bitch 46
need 46
addams 43
die 43
hit 43
mama 43
money 43
lyrics 42
little 41
shorty 41
play 40
shook 40
crossroads 38
kick 38
knock 38
check 37
relax 37
settle 37
tell 37
thug 36
da 33
gangster 33
think 33
touch 33
boogie 32
crazy 32
try 32
want 32
wo 32
dance 31
insane 31
hard 30
la 30
understand 30
cause 29
ruggish 29
thuggish 29
ass 28
head 28
month 28
pac 28
buck 27
feel 27
cash 26
family 26
kill 26
mind 25
roses 25
word 25
yes 25
baby 24
game 24
smell 24
world 24
gettin 23
hear 23
life 23
checks 22
boy 21
fuckin 21
rhyme 21
roll 21
bong 20
bring 20
inside 20
long 20
pray 20
shake 20
things 20
thugs 20
wrong 20
big 19
brain 19
everybody 19
g 19
ghetto 19
girls 19
gone 19
hail 19
ready 19
tried 19
damn 18
hits 18
mad 18
mary 18
o 18
stop 18
thing 18
away 17
bad 17
friend 17
good 17
illusions 17
black 16
bust 16
forever 16
god 16
home 16
ride 16
times 16
beat 15
bit 15
crack 15
cry 15
everyday 15
high 15
kid 15
lady 15
new 15
pay 15
queens 15
stay 15
streets 15
block 14
came 14
eyes 14
going 14
hammer 14
lean 14
smoke 14
straight 14
style 14
sweet 14
test 14
watch 14
comin 13
hands 13
jackson 13
look 13
loving 13
people 13
quick 13
shot 13
slap 13
step 13
tryin 13
work 13
believe 12
brother 12
change 12
cheeks 12
child 12
closer 12
crew 12
daddy 12
eat 12
face 12
goes 12
hell 12
livin 12
makin 12
membrane 12
men 12
nice 12
phife 12
stank 12
sure 12
tryna 12
women 12
break 11
close 11
daughter 11
deal 11
find 11
ha 11
heard 11
hopin 11
kids 11
lonely 11
meant 11
motherfuckers 11
pass 11
pull 11
reminisce 11
represent 11
runnin 11
sorry 11
street 11
talking 11
tequila 11
til 11
told 11
wit 11
wonder 11
air 10
apologize 10
aww 10
bitches 10
blunt 10
burn 10
cold 10
cut 10
dead 10
fall 10
fat 10
follow 10
hand 10
lay 10
leave 10
listen 10
miss 10
old 10
outta 10
pen 10
realize 10
rip 10
rock 10
scenario 10
talk 10
tip 10
trillion 10
wait 10
best 9
blow 9
confusion 9
deep 9
drop 9
east 9
feeling 9
feet 9
fine 9
gets 9
hate 9
hold 9
later 9
law 9
lookin 9
lord 9
lot 9
luv 9
makes 9
mc 9
meet 9
mo 9
motherfuckin 9
pain 9
plus 9
po 9
princess 9
punk 9
raised 9
rap 9
rest 9
son 9
started 9
sunrise 9
takin 9
thank 9
thinking 9
thought 9
town 9
tribe 9
true 9
ugh 9
walk 9
war 9
young 9
benz 8
brooklyn 8
brothers 8
care 8
catch 8
changes 8
coast 8
comes 8
cool 8
dough 8
drama 8
ear 8
end 8
fight 8
flow 8
fucked 8
gat 8
glock 8
hope 8
hot 8
jack 8
ladies 8
mean 8
named 8
pimp 8
place 8
point 8
pop 8
posted 8
raise 8
remember 8
renee 8
rhythm 8
rollin 8
saying 8
school 8
seen 8
sing 8
spot 8
sweat 8
throw 8
track 8
wet 8
woman 8
words 8
act 7
appreciated 7
aquemini 7
bloodshot 7
cops 7
dark 7
devil 7
drivin 7
father 7
fish 7
folks 7
funky 7
getting 7
hair 7
half 7
house 7
ice 7
kinda 7
left 7
lie 7
lil 7
lost 7
low 7
maybe 7
motherfucker 7
n 7
plan 7
played 7
rain 7
rocks 7
running 7
s 7
sh 7
shout 7
sleep 7
soul 7
state 7
talkin 7
took 7
wave 7
weed 7
wide 7
y 7
battle 6
body 6
bom 6
born 6
chill 6
clean 6
creep 6
crime 6
days 6
dear 6
dope 6
double 6
fact 6
feelin 6
fell 6
flesh 6
fly 6
fool 6
forget 6
fresh 6
funk 6
gave 6
grab 6
grits 6
heat 6
heaven 6
hoods 6
ill 6
late 6
lights 6
looking 6
lyrical 6
making 6
mamas 6
met 6
mother 6
mouth 6
nah 6
night 6
okay 6
paper 6
peace 6
poor 6
raw 6
rhymes 6
rough 6
scared 6
set 6
slow 6
smokin 6
somebody 6
sound 6
sun 6
tight 6
turn 6
unh 6
wack 6
weak 6
wear 6
wish 6
yea 6
years 6
ask 5
babies 5
biggie 5
bills 5
blunts 5
boo 5
boom 5
bounce 5
brighter 5
brown 5
canibus 5
caroline 5
caught 5
chest 5
cleveland 5
coups 5
crash 5
damage 5
dawg 5
def 5
dick 5
door 5
doubt 5
dream 5
floor 5
fucking 5
green 5
guns 5
haha 5
hearts 5
hole 5
honey 5
hood 5
hop 5
hustle 5
jeeps 5
kickin 5
king 5
knew 5
lasts 5
letter 5
lex 5
light 5
living 5
matter 5
minute 5
misery 5
mothafucka 5
murder 5
needed 5
p 5
paid 5
picture 5
piece 5
playa 5
punks 5
record 5
relate 5
rent 5
rich 5
round 5
rules 5
rump 5
short 5
sister 5
smack 5
song 5
soon 5
start 5
stress 5
stronger 5
sugar 5
t 5
trip 5
verse 5
victim 5
wall 5
wanted 5
water 5
ways 5
went 5
wild 5
workin 5
yer 5
