like 4912
yeah 4712
got 3890
nigga 2833
know 2715
bitch 2533
ai 2481
fuck 2163
shit 1810
niggas 1743
love 1486
baby 1334
want 1231
let 1180
oh 1167
money 1166
gon 1140
wanna 1111
girl 1085
right 1068
ooh 1015
need 969
time 912
way 872
ayy 815
uh 814
tell 806
ass 801
hit 799
man 771
bitches 734
lyrics 720
said 693
ta 646
watch 630
la 611
new 601
tryna 585
look 584
feel 580
pussy 572
come 570
lil 545
real 544
life 541
ya 536
think 530
hey 529
good 520
fuckin 479
big 474
boy 469
ho 462
bad 447
night 447
hoes 439
told 437
pull 436
gang 430
woo 424
huh 417
turn 403
day 401
yo 398
cause 392
god 389
mind 380
drop 374
pop 362
da 354
leave 354
talk 350
play 347
better 345
wo 345
ride 343
left 339
high 336
aye 335
damn 334
hold 331
came 329
face 325
head 315
young 315
hard 314
run 313
walk 310
everybody 306
na 301
stop 299
bag 290
okay 287
little 285
rich 284
shawty 281
ah 277
bust 277
dick 269
trap 263
til 262
beat 261
nah 261
black 259
gettin 257
woah 256
mama 253
skrrt 250
party 248
check 247
hot 247
kill 246
stay 246
talkin 246
lot 242
bring 239
change 239
long 235
thing 233
break 231
dance 228
girls 226
whip 226
straight 225
world 225
cut 223
swear 223
body 222
city 221
fucked 217
work 217
low 216
type 215
bop 213
feelin 211
old 211
club 210
act 209
home 209
try 209
mad 208
friends 207
gucci 206
house 206
cash 202
diamonds 201
white 201
lookin 200
broke 198
crazy 198
heart 198
different 194
hope 194
die 193
live 193
getting 191
round 191
going 190
smoke 189
hop 188
hands 186
thought 185
hate 184
molly 183
game 182
mean 182
shoot 182
block 180
fly 180
o 180
red 178
throw 178
heard 176
shots 176
swerve 176
best 175
took 175
fucking 173
wrist 173
ball 172
away 169
ring 168
fast 167
blow 163
hell 163
bands 161
believe 160
catch 158
hood 158
ice 158
ready 158
b 157
bang 157
car 157
gas 157
slow 156
phone 155
lie 154
lean 153
teach 153
find 152
hol 151
roll 151
feeling 150
rock 150
things 150
times 150
ha 149
light 148
pay 147
shake 147
started 146
care 144
went 144
eyes 142
taste 141
gave 140
gone 140
dougie 139
k 139
rollie 139
ballin 138
d 138
g 138
miss 138
people 138
yes 138
bank 137
free 137
wait 137
dope 135
freak 135
bounce 134
brr 134
fall 134
thick 134
ask 133
comin 133
drip 133
twerk 133
wrong 133
pain 132
poppin 130
murder 129
eat 128
fight 128
racks 128
seen 128
woke 127
hatin 125
bought 124
drink 124
friend 124
pass 124
trust 124
school 123
boss 122
faded 122
hear 122
bet 121
gun 121
inside 121
line 121
rain 121
rap 121
remember 120
true 120
alright 118
cup 118
saying 118
m 117
start 117
gold 116
probably 116
sit 116
dog 115
floor 115
gangsta 115
lose 115
playin 115
plug 115
buy 114
chain 114
flex 114
ay 113
dream 113
keys 113
mouth 113
push 113
runnin 113
somebody 113
tired 113
cold 111
couple 111
drive 111
neck 110
shot 109
town 109
fine 108
monster 108
rose 108
sorry 108
crack 107
dawg 107
wet 107
knock 106
talking 106
trying 105
drank 104
stand 104
dead 103
soul 103
tonight 103
street 102
touch 102
blood 101
di 101
knew 101
coupe 100
maybe 100
nae 100
slatt 100
walkin 100
hand 99
livin 99
homie 98
rack 98
sheck 98
shorty 98
truth 98
foreign 97
help 97
stupid 97
bentley 96
motherfuckin 96
weed 96
cool 95
deep 95
drippin 95
guess 95
lord 95
set 95
spend 95
wild 95
lay 94
smokin 94
t 94
boys 93
lost 93
door 92
looking 92
whoa 92
worried 92
foot 91
matter 91
slide 91
wanted 91
bout 90
brain 90
needed 90
streets 90
dumb 89
feelings 89
minute 89
wish 89
hair 88
million 88
outta 88
vibe 88
cardi 87
e 87
sayin 87
today 87
daddy 86
ridin 86
send 86
thang 86
fake 85
fire 85
hustle 85
living 85
place 85
road 85
suck 85
understand 85
pedal 84
s 84
team 84
paper 83
pump 83
song 83
sound 83
caught 82
fresh 82
word 82
chick 81
goes 81
open 81
worth 81
booty 80
sippin 80
water 80
crib 79
em 79
pick 79
pockets 79
pole 79
quiet 79
remix 79
brand 78
meet 78
pretty 78
wasted 78
year 78
coming 77
lit 77
london 77
music 77
room 77
tiimmy 77
tried 77
trippin 77
chopper 76
forever 76
legs 76
problem 76
sauce 76
sex 76
wes 76
days 75
thousand 75
hah 74
king 74
loud 74
perfect 74
star 74
wake 74
bit 73
count 73
deal 73
fool 73
killin 73
thot 73
air 72
case 72
flow 72
kick 72
morning 72
paid 72
playing 72
quick 72
wit 72
double 71
drugs 71
hurt 71
listen 71
stick 71
track 71
wonder 71
scared 70
super 70
thinkin 70
y 70
bobby 69
dab 69
finna 69
pray 69
reason 69
spot 69
turnt 69
week 69
yuh 69
clean 68
clothes 68
eh 68
homies 68
kiss 68
loco 68
makin 68
blue 67
designer 67
fat 67
glock 67
haters 67
skrt 67
smile 67
cop 66
end 66
kids 66
pack 66
yellow 66
aight 65
business 65
chains 65
louis 65
main 65
p 65
actin 64
bed 64
benz 64
diamond 64
dollars 64
dreams 64
feet 64
workin 64
crew 63
nose 63
pour 63
shmoney 63
sleep 63
smoking 63
x 63
callin 62
fell 62
flip 62
flocka 62
jesus 62
late 62
number 62
outside 62
past 62
women 62
balling 61
fleek 61
hennessy 61
met 61
middle 61
mm 61
soon 61
turned 61
jump 60
killing 60
shoes 60
sun 60
teeth 60
yah 60
cry 59
half 59
lady 59
mo 59
porsche 59
rari 59
speak 59
tellin 59
easy 58
finger 58
numb 58
ones 58
ran 58
running 58
safe 58
squad 58
tap 58
treat 58
west 58
bow 57
control 57
finally 57
flexin 57
ghost 57
grab 57
sure 57
woman 57
bae 56
close 56
family 56
hoe 56
jet 56
motherfucker 56
save 56
stuck 56
switch 56
blah 55
boo 55
bro 55
dollar 55
forget 55
juice 55
key 55
motherfucking 55
peace 55
pocket 55
point 55
seat 55
shirt 55
sick 55
speed 55
takin 55
waste 55
yea 55
zone 55
blaow 54
blessin 54
dat 54
fame 54
goddamn 54
green 54
hundreds 54
killed 54
blessed 53
bling 53
blunt 53
cocaine 53
outchea 53
step 53
brrt 52
cars 52
ex 52
grind 52
liquor 52
making 52
press 52
son 52
swing 52
blame 51
ceiling 51
facts 51
moving 51
sign 51
strong 51
taking 51
text 51
trappin 51
war 51
bend 50
bottles 50
hoo 50
l 50
lights 50
pants 50
power 50
quan 50
sip 50
thinking 50
toes 50
ugh 50
waka 50
wraith 50
beef 49
brick 49
chase 49
dig 49
dirty 49
doors 49
dropped 49
drunk 49
dump 49
famous 49
jail 49
lane 49
loving 49
ma 49
plate 49
scene 49
use 49
clap 48
cost 48
fa 48
fun 48
holy 48
lotta 48
movie 48
nails 48
pills 48
savage 48
scoop 48
shout 48
sky 48
slayed 48
stack 48
style 48
winnin 48
wishin 48
zooted 48
bleed 47
blowin 47
brother 47
codeine 47
great 47
knows 47
miami 47
mornin 47
problems 47
shinin 47
shootin 47
skr 47
swipe 47
titties 47
wear 47
bugatti 46
fetti 46
guys 46
judge 46
kitchen 46
lame 46
momma 46
promise 46
riding 46
saw 46
single 46
songs 46
state 46
stoner 46
bags 45
dough 45
found 45
guap 45
lick 45
naked 45
prolly 45
que 45
rockin 45
rollin 45
win 45
bruh 44
cake 44
chill 44
dancin 44
funny 44
hang 44
hello 44
kinda 44
leg 44
mmm 44
police 44
read 44
roof 44
thank 44
babe 43
bumpin 43
champagne 43
chance 43
drinkin 43
killers 43
news 43
slim 43
studio 43
trick 43
worry 43
bustin 42
caliber 42
champion 42
choice 42
countin 42
ee 42
fade 42
fore 42
li 42
pipe 42
private 42
pulled 42
rappers 42
rest 42
rob 42
shine 42
spent 42
swag 42
watching 42
bound 41
bricks 41
brought 41
c 41
checks 41
daughter 41
death 41
dress 41
feds 41
fill 41
gyal 41
hella 41
mercy 41
panda 41
phantom 41
skrr 41
trip 41
tryin 41
ye 41
bicken 40
blinded 40
chest 40
coco 40
cross 40
deuce 40
far 40
flame 40
haha 40
happy 40
hide 40
later 40
losin 40
movin 40
muh 40
overnight 40
pistol 40
price 40
respect 40
runner 40
sell 40
seven 40
shut 40
sweet 40
thirsty 40
throwin 40
window 40
beam 39
bih 39
bullets 39
burn 39
cheese 39
comes 39
drug 39
kid 39
kind 39
kyrie 39
ladies 39
lamborghini 39
mmh 39
owe 39
picture 39
pictures 39
regular 39
screamin 39
stank 39
thug 39
words 39
years 39
bigger 38
bills 38
cartier 38
deserve 38
dude 38
feed 38
ground 38
lambo 38
num 38
oakland 38
pew 38
sheesh 38
telling 38
truck 38
trump 38
watchin 38
ways 38
account 37
arms 37
asked 37
birthday 37
breathe 37
dash 37
dj 37
donald 37
fact 37
future 37
hookah 37
hunnid 37
kept 37
post 37
quarter 37
sleepin 37
spit 37
store 37
thotiana 37
versace 37
askin 36
born 36
called 36
chippi 36
choppa 36
clip 36
dark 36
finish 36
heat 36
mil 36
moment 36
nice 36
person 36
pimp 36
pool 36
rolls 36
sittin 36
south 36
tight 36
v 36
yup 36
anybody 35
attitude 35
bottle 35
camera 35
cops 35
dip 35
duff 35
esskeetit 35
furnace 35
games 35
gotti 35
h 35
handle 35
jewelry 35
luck 35
mask 35
mothafuckin 35
nasty 35
og 35
rolling 35
skateboard 35
spin 35
steady 35
stylist 35
summer 35
tear 35
arm 34
bread 34
figure 34
french 34
grip 34
happen 34
hopped 34
pot 34
rockstar 34
sing 34
smell 34
thirty 34
whippin 34
alive 33
bullshit 33
chanel 33
changed 33
chyeah 33
doctor 33
git 33
guns 33
jeans 33
load 33
meant 33
piece 33
pound 33
queen 33
rep 33
rider 33
sad 33
slime 33
thoughts 33
wrapped 33
automatic 32
bite 32
boom 32
busy 32
died 32
dlow 32
doo 32
focused 32
girlfriend 32
grindin 32
hungry 32
lately 32
lifestyle 32
mall 32
moves 32
plan 32
print 32
proud 32
rocking 32
row 32
space 32
wifey 32
wow 32
york 32
box 31
college 31
dying 31
early 31
eatin 31
fans 31
harder 31
hating 31
henny 31
hills 31
honey 31
job 31
kodak 31
lies 31
lock 31
locs 31
looked 31
macarena 31
necklace 31
rapper 31
record 31
rip 31
sack 31
sellin 31
sumn 31
threw 31
waist 31
wave 31
attention 30
ba 30
blew 30
bored 30
brown 30
cute 30
droppin 30
drum 30
f 30
father 30
felt 30
givin 30
humble 30
learn 30
maría 30
maybach 30
nope 30
ok 30
popped 30
shower 30
slippin 30
soda 30
steal 30
supposed 30
tears 30
throwing 30
ticket 30
touchdown 30
twerkin 30
twice 30
waiting 30
ahh 29
bomb 29
bunch 29
burner 29
cap 29
cookin 29
dancer 29
dee 29
faith 29
fendi 29
follow 29
forgot 29
glamorous 29
hangin 29
horse 29
insane 29
knees 29
known 29
lips 29
ocho 29
plane 29
pose 29
pullin 29
season 29
strip 29
suicidal 29
wiggle 29
wildin 29
yung 29
acting 28
ap 28
atlanta 28
bodies 28
booth 28
chances 28
class 28
clear 28
drown 28
fo 28
glad 28
grow 28
hip 28
imagine 28
inch 28
killer 28
list 28
mix 28
mom 28
offset 28
period 28
pinky 28
prove 28
quit 28
retarded 28
selling 28
stars 28
tec 28
u 28
waitin 28
wallet 28
wrote 28
afford 27
andalay 27
birkin 27
bish 27
bool 27
bullet 27
chicken 27
clique 27
commas 27
cook 27
dive 27
earth 27
feels 27
glass 27
grown 27
haan 27
hittin 27
icy 27
instead 27
jerk 27
lemon 27
lemonade 27
locked 27
loose 27
means 27
ouu 27
ow 27
partner 27
plus 27
rappin 27
rings 27
rules 27
shows 27
signed 27
singing 27
slaughter 27
small 27
smash 27
stress 27
uhh 27
book 26
brothers 26
bucks 26
calling 26
devil 26
flash 26
forgive 26
freeze 26
gram 26
instagram 26
lanes 26
learned 26
leavin 26
mac 26
match 26
milli 26
mirror 26
missing 26
mud 26
nother 26
raw 26
scream 26
shooters 26
skrilla 26
sold 26
soundin 26
texas 26
till 26
toe 26
vibes 26
weak 26
weight 26
wipe 26
beats 25
bird 25
bone 25
ching 25
church 25
cinco 25
corner 25
country 25
dime 25
dogs 25
eye 25
favorite 25
food 25
giving 25
grandma 25
happened 25
hater 25
higher 25
hola 25
holdin 25
honest 25
jordan 25
jungle 25
khaled 25
league 25
message 25
opp 25
paint 25
park 25
patek 25
player 25
ringin 25
roxanne 25
saved 25
sight 25
sister 25
stanky 25
tomorrow 25
turner 25
upset 25
walked 25
wheel 25
wife 25
working 25
z 25
answer 24
band 24
baow 24
bar 24
beautiful 24
belt 24
cat 24
chop 24
clown 24
crash 24
cuz 24
drinking 24
fah 24
fear 24
fit 24
hmm 24
iced 24
jealous 24
jumpin 24
land 24
magic 24
mercedes 24
mission 24
mother 24
notice 24
percocets 24
pink 24
popping 24
profit 24
ratchet 24
rounds 24
sunday 24
tip 24
toast 24
trouble 24
uber 24
usually 24
action 23
attached 23
barbie 23
blowing 23
boat 23
breath 23
building 23
calls 23
cell 23
closed 23
court 23
dinner 23
drownin 23
dub 23
fashion 23
flexing 23
grand 23
guy 23
happening 23
hollywood 23
jaw 23
joke 23
kobe 23
level 23
lonely 23
lyin 23
married 23
pair 23
pourin 23
prada 23
screaming 23
second 23
signs 23
skin 23
swervin 23
tape 23
tempo 23
twin 23
vision 23
walking 23
write 23
ambitions 22
angels 22
baddest 22
bando 22
blueface 22
bury 22
bus 22
child 22
chillin 22
crip 22
curve 22
date 22
dna 22
dolla 22
don 22
ear 22
east 22
everyday 22
extra 22
fallin 22
field 22
flock 22
gnashin 22
kissin 22
link 22
makes 22
merengue 22
michael 22
mudboy 22
opps 22
paris 22
pill 22
played 22
pow 22
pressure 22
remy 22
rice 22
spray 22
story 22
struggle 22
sugar 22
swimmin 22
trigger 22
tv 22
verse 22
w 22
wall 22
weepin 22
wine 22
yoo 22
afraid 21
barely 21
beep 21
bein 21
blessings 21
brews 21
card 21
cards 21
chika 21
coke 21
cousin 21
dawgs 21
dot 21
drama 21
dreaming 21
fam 21
fault 21
flippin 21
flossy 21
fraud 21
hat 21
having 21
nicki 21
note 21
pickin 21
poor 21
prayin 21
questions 21
radar 21
realest 21
sak 21
sexy 21
ship 21
shop 21
skinny 21
slum 21
slums 21
sock 21
socks 21
stacks 21
stove 21
swish 21
toss 21
tote 21
ugly 21
vip 21
worse 21
ysl 21
ace 20
admit 20
apart 20
babies 20
beast 20
blind 20
broad 20
broads 20
butt 20
butter 20
bye 20
cali 20
california 20
candy 20
chainz 20
choose 20
crowd 20
dem 20
doubt 20
el 20
favors 20
flick 20
flyin 20
foreigns 20
friday 20
gets 20
golden 20
grade 20
headed 20
heaven 20
heavy 20
hug 20
independent 20
jack 20
laugh 20
lockin 20
loot 20
mess 20
mi 20
millions 20
montana 20
mothafucka 20
mula 20
north 20
pa 20
packs 20
passed 20
phones 20
race 20
raise 20
rick 20
rocks 20
saint 20
santa 20
saturday 20
selfish 20
showed 20
slap 20
solve 20
split 20
stash 20
stomach 20
switchin 20
tall 20
taught 20
te 20
trees 20
twerkulator 20
weekend 20
ak 19
america 19
bill 19
choppers 19
concert 19
cooking 19
counting 19
delicious 19
difference 19
eating 19
ego 19
geeked 19
gossip 19
greatest 19
happens 19
hi 19
hoppin 19
hottest 19
houston 19
jackson 19
laurent 19
lemons 19
moanin 19
monday 19
moon 19
pardon 19
platinum 19
plenty 19
projects 19
question 19
raised 19
rooster 19
shade 19
shotta 19
sir 19
southside 19
stackin 19
stage 19
strap 19
strapped 19
sweat 19
thugger 19
tool 19
trunk 19
trusting 19
tssh 19
vacation 19
wrap 19
yee 19
addict 18
ago 18
angel 18
ape 18
bah 18
bankroll 18
basic 18
bean 18
bougie 18
brains 18
brrr 18
buck 18
bulgin 18
bum 18
carpet 18
chair 18
chasin 18
children 18
coast 18
code 18
color 18
cuban 18
cum 18
dancing 18
demon 18
demons 18
dirt 18
drake 18
ease 18
eighty 18
expensive 18
fabo 18
finished 18
fix 18
flight 18
folks 18
grammy 18
hahaha 18
hole 18
hour 18
j 18
kitty 18
lawyer 18
lo 18
menace 18
mic 18
milly 18
mustard 18
near 18
nervous 18
older 18
po 18
poured 18
pretend 18
pure 18
range 18
reach 18
rent 18
revved 18
shame 18
shoe 18
shoulda 18
shoulder 18
showin 18
slave 18
smooth 18
special 18
spendin 18
steak 18
stomp 18
stripper 18
tag 18
throat 18
thuggin 18
tokyo 18
traffic 18
triple 18
tripping 18
tweet 18
weather 18
wedding 18
addicts 17
aim 17
bakin 17
bangin 17
bay 17
beware 17
blunts 17
bright 17
crank 17
creepin 17
cryin 17
curse 17
de 17
dial 17
draco 17
dressed 17
driving 17
excuse 17
fair 17
fan 17
focus 17
fold 17
foo 17
freaky 17
freezer 17
froze 17
gift 17
gosh 17
guantanamera 17
hammer 17
heels 17
hero 17
imma 17
important 17
internet 17
jumped 17
keepin 17
knockin 17
kush 17
lake 17
lames 17
limit 17
lover 17
metro 17
milf 17
mixed 17
moly 17
mothafuckas 17
naw 17
nina 17
noise 17
puttin 17
rod 17
salute 17
scary 17
semi 17
sent 17
short 17
shoutout 17
shuffle 17
silentó 17
slang 17
soft 17
speakin 17
squeeze 17
standards 17
stoppin 17
strings 17
stuff 17
suckin 17
surprise 17
swisha 17
tasty 17
thighs 17
thumbing 17
um 17
voice 17
whores 17
witness 17
wood 17
wop 17
worst 17
woulda 17
xans 17
aid 16
alert 16
average 16
ayo 16
balenciaga 16
bars 16
beach 16
boyfriend 16
boyz 16
broken 16
buildin 16
charge 16
click 16
cookie 16
crooked 16
cuff 16
davy 16
diss 16
drivin 16
dry 16
exes 16
faces 16
fakin 16
fifth 16
figures 16
fish 16
flew 16
flood 16
freestyle 16
gimme 16
glow 16
goosebumps 16
habit 16
halloween 16
hurry 16
jacket 16
james 16
jigga 16
jiggy 16
john 16
kanye 16
knife 16
le 16
legend 16
lemme 16
loved 16
mattress 16
misunderstood 16
mixtape 16
mode 16
mop 16
ni 16
nights 16
nigo 16
nuts 16
overseas 16
panties 16
parted 16
parties 16
pin 16
pint 16
posted 16
pro 16
public 16
purple 16
r 16
reppin 16
route 16
royce 16
rubber 16
rush 16
seats 16
seein 16
self 16
showers 16
sipping 16
sneak 16
stressin 16
table 16
tay 16
test 16
thou 16
tongue 16
trenches 16
upgrade 16
wayne 16
wings 16
yg 16
ali 15
anymore 15
blast 15
blocks 15
bonjour 15
bowl 15
breaking 15
bunny 15
cane 15
cater 15
clout 15
correct 15
credit 15
crossed 15
crown 15
darling 15
envy 15
fail 15
fed 15
fergie 15
ferrari 15
flag 15
frame 15
goose 15
grams 15
grill 15
grr 15
heartbeat 15
hill 15
hours 15
influence 15
jimmy 15
jobs 15
kai 15
keeps 15
kool 15
là 15
laid 15
large 15
lead 15
lesson 15
likeembed 15
lunch 15
madame 15
mane 15
mansion 15
medicine 15
mike 15
missin 15
model 15
mood 15
motherfuckers 15
nike 15
normal 15
notch 15
ohh 15
pac 15
paparazzi 15
pase 15
perc 15
poison 15
relate 15
rolled 15
rude 15
satan 15
satellites 15
shady 15
sides 15
sitting 15
sixteen 15
snatch 15
snitch 15
spinnin 15
standing 15
stretch 15
stunt 15
surprised 15
tatted 15
tie 15
tippy 15
titty 15
tone 15
tony 15
tour 15
trapping 15
turnin 15
voices 15
vvs 15
weave 15
windows 15
woop 15
youngin 15
add 14
anthem 14
argue 14
assim 14
bardi 14
becky 14
bi 14
billy 14
bleeding 14
blown 14
bopping 14
bottoms 14
boule 14
bucket 14
cómo 14
caroline 14
carti 14
catching 14
chasing 14
chips 14
cocky 14
conversation 14
crashed 14
dad 14
dare 14
decide 14
distant 14
dm 14
duck 14
dummy 14
enemies 14
flying 14
gifted 14
hittas 14
holes 14
hooh 14
hopin 14
hype 14
jam 14
jane 14
konnichiwa 14
leanin 14
lords 14
loyal 14
loyalty 14
mắn 14
map 14
metal 14
movies 14
n 14
papi 14
piss 14
plain 14
pollie 14
psycho 14
puff 14
ross 14
rover 14
score 14
sean 14
section 14
shmurda 14
shoppin 14
shopping 14
shoulders 14
silly 14
sin 14
size 14
solid 14
spanish 14
sprite 14
stones 14
stressed 14
stuntin 14
tea 14
thots 14
touchin 14
tragic 14
trash 14
turning 14
uncle 14
vegas 14
wan 14
zig 14
age 13
ate 13
balls 13
ben 13
boolin 13
booted 13
bossy 13
boulevard 13
bra 13
breakfast 13
bridge 13
careful 13
carry 13
cheap 13
cheated 13
chris 13
clips 13
coat 13
condom 13
couch 13
coulda 13
cover 13
dealing 13
disrespect 13
dolce 13
ended 13
estás 13
flat 13
flooded 13
fur 13
gates 13
glocks 13
history 13
hits 13
hotter 13
jugg 13
knowin 13
kong 13
law 13
linen 13
listening 13
louboutin 13
major 13
mexico 13
mile 13
missed 13
mob 13
mwah 13
nowadays 13
ooouuu 13
option 13
polo 13
pre 13
pregnant 13
reverse 13
rhyme 13
richer 13
rodeo 13
rrrah 13
rumors 13
says 13
sendin 13
sense 13
serve 13
sheets 13
shooter 13
singin 13
sink 13
slidin 13
snakes 13
snap 13
soy 13
spice 13
staring 13
stayed 13
stripes 13
suicide 13
swallow 13
thursday 13
trill 13
wearin 13
wetter 13
whips 13
yard 13
yawk 13
zip 13
advice 12
answers 12
ashamed 12
banana 12
battle 12
beans 12
bestie 12
biggie 12
bike 12
birds 12
bless 12
blessing 12
boppin 12
brag 12
bringing 12
brooklyn 12
bump 12
burnin 12
buyin 12
ceo 12
choke 12
clappin 12
comfortable 12
copped 12
cream 12
daily 12
dangerous 12
dice 12
diddy 12
dipped 12
dissin 12
dyin 12
en 12
energy 12
ev 12
evil 12
extended 12
falling 12
fergalicious 12
frontin 12
gabbana 12
gangster 12
garage 12
ginóbili 12
glizzy 12
goals 12
grew 12
holding 12
human 12
hustlin 12
ill 12
juggin 12
lamb 12
leather 12
licks 12
lied 12
limelight 12
lives 12
looks 12
lottery 12
luke 12
mail 12
mami 12
martin 12
men 12
milk 12
month 12
neighbors 12
nonsense 12
obsession 12
ocean 12
peep 12
pero 12
planet 12
plottin 12
praise 12
praying 12
pride 12
prince 12
prison 12
pushin 12
q 12
radio 12
ray 12
regret 12
replace 12
represent 12
rewind 12
rid 12
rims 12
roles 12
romp 12
saucin 12
scope 12
scratch 12
se 12
seater 12
service 12
shallow 12
shining 12
shits 12
skeet 12
snake 12
snatched 12
snow 12
solo 12
static 12
steps 12
sticks 12
stone 12
swim 12
syrup 12
takes 12
teacher 12
tech 12
tee 12
thomas 12
toot 12
ultralight 12
vem 12
vroom 12
watches 12
welcome 12
wig 12
wobble 12
yep 12
zombiie 12
zoowap 12
actavis 11
addy 11
ahead 11
al 11
album 11
anthony 11
aw 11
balenciagas 11
basement 11
bass 11
blazin 11
bombs 11
calm 11
cameras 11
cappin 11
celebrate 11
ch 11
checkin 11
chevy 11
chicago 11
circle 11
claim 11
course 11
cups 11
damage 11
david 11
deposit 11
digits 11
donut 11
drrrat 11
drums 11
dun 11
dust 11
easier 11
ecstasy 11
ends 11
es 11
exercise 11
facetime 11
fancy 11
fiend 11
fiends 11
fingers 11
flames 11
flop 11
foul 11
fu 11
ghetto 11
glue 11
groupie 11
hallelujah 11
hanging 11
happenin 11
hearin 11
hotel 11
jay 11
kemo 11
kicked 11
kickin 11
kilo 11
label 11
lavish 11
layin 11
legit 11
lines 11
loaded 11
lobby 11
lone 11
losing 11
lowkey 11
lucky 11
lust 11
mala 11
malibu 11
mans 11
maserati 11
matte 11
meal 11
meat 11
meek 11
meetin 11
mention 11
minutes 11
models 11
motherfuck 11
mountain 11
named 11
needs 11
nerd 11
nicotine 11
nut 11
order 11
pat 11
patience 11
pissed 11
preach 11
proceed 11
reel 11
rookie 11
rough 11
sacrifice 11
salad 11
scum 11
shh 11
sinner 11
skip 11
slaves 11
slept 11
slice 11
smack 11
sniper 11
spaceship 11
speaking 11
sporty 11
sprinter 11
stepping 11
storm 11
strippers 11
stuffed 11
stunting 11
substance 11
success 11
superstar 11
system 11
textin 11
thangs 11
thinks 11
title 11
tools 11
tooth 11
tuesday 11
tune 11
tunechi 11
ups 11
venus 11
voy 11
wanting 11
wham 11
wind 11
wishing 11
addicted 10
address 10
anh 10
art 10
asshole 10
baguettes 10
bape 10
bent 10
bimmer 10
blank 10
brazy 10
bros 10
buckle 10
bully 10
bummer 10
bussin 10
cam 10
chateau 10
cheeks 10
chi 10
christmas 10
closer 10
cologne 10
coochie 10
crush 10
curry 10
cutie 10
cuts 10
danny 10
dawn 10
dudes 10
dues 10
dyke 10
enjoy 10
escape 10
exactly 10
ferg 10
fightin 10
fighting 10
film 10
finesse 10
fountain 10
fully 10
givenchy 10
gorillas 10
government 10
grass 10
grave 10
grinding 10
hobby 10
icky 10
ignorin 10
iii 10
juicy 10
jumping 10
kẻ 10
keeping 10
kendrick 10
kevin 10
knob 10
leash 10
leaves 10
lettin 10
lined 10
lived 10
lolo 10
longer 10
lovers 10
magi 10
makeup 10
mamacita 10
mark 10
mental 10
mhm 10
migraine 10
mill 10
mink 10
murda 10
neutron 10
như 10
numbers 10
opportunity 10
options 10
palm 10
partners 10
pen 10
peons 10
petty 10
places 10
plans 10
plays 10
pokin 10
porch 10
proof 10
purse 10
putting 10
quarterback 10
rah 10
rat 10
remind 10
ricky 10
rise 10
rocky 10
rolex 10
safety 10
searchin 10
security 10
seeing 10
shades 10
sho 10
silence 10
silento 10
simple 10
skirt 10
slangin 10
slick 10
slip 10
smart 10
smith 10
sneaks 10
sola 10
soulja 10
spread 10
stare 10
steppin 10
suit 10
superman 10
surrounded 10
swaggin 10
swerving 10
swimming 10
swishers 10
swole 10
tank 10
tats 10
tecca 10
thalia 10
threat 10
throne 10
thunder 10
ting 10
tinted 10
touched 10
travel 10
tu 10
twenties 10
uno 10
uzi 10
và 10
verses 10
view 10
vv 10
wack 10
wakin 10
wassup 10
weapon 10
wednesday 10
weird 10
whitney 10
wiped 10
worldwide 10
xan 10
yacht 10
yay 10
youngboy 10
actually 9
alcohol 9
applause 9
army 9
audemars 9
audi 9
babylon 9
baller 9
bananas 9
barbarian 9
barbed 9
beatin 9
belong 9
betcha 9
biggest 9
bloaw 9
bloods 9
boogie 9
boosie 9
boots 9
bother 9
bounced 9
brake 9
bruce 9
bull 9
burnt 9
button 9
buying 9
byrie 9
casa 9
chat 9
cheating 9
chicks 9
christian 9
clock 9
clumsy 9
clutchin 9
coffin 9
columbiana 9
company 9
compton 9
conversate 9
covered 9
creep 9
crippin 9
dealer 9
decisions 9
degrees 9
dej 9
desire 9
devils 9
disappear 9
drawers 9
dread 9
drinks 9
driver 9
eater 9
emotions 9
everytime 9
exclusive 9
feature 9
fellas 9
fifties 9
filled 9
flanders 9
flyest 9
folk 9
fucks 9
fuego 9
goons 9
grimy 9
group 9
grove 9
guala 9
gym 9
ham 9
heads 9
heel 9
highway 9
hitting 9
hm 9
holler 9
homicide 9
hurts 9
hustling 9
iggin 9
ignore 9
industry 9
inglewood 9
irrelevant 9
jamaica 9
jean 9
jewels 9
jordans 9
july 9
keith 9
kelly 9
ki 9
kidneys 9
knowing 9
lace 9
lackin 9
laughin 9
lawyers 9
leaving 9
likely 9
liver 9
lungs 9
manners 9
marc 9
mary 9
math 9
meaning 9
memory 9
migo 9
mileage 9
millionaire 9
moms 9
months 9
moonrocks 9
moonwalking 9
motion 9
moved 9
mulsanne 9
muscle 9
nada 9
ned 9
net 9
nod 9
onyx 9
oven 9
parts 9
patient 9
pecan 9
penitentiary 9
philly 9
plastic 9
popstar 9
pulling 9
quiero 9
reality 9
reasons 9
reckless 9
records 9
representin 9
reputation 9
rihanna 9
riverdale 9
robbed 9
role 9
rub 9
rule 9
salon 9
salt 9
scouts 9
seasons 9
shocked 9
shorter 9
sins 9
sisters 9
sleeve 9
smoove 9
sniff 9
sober 9
soldier 9
spirit 9
spirits 9
spittin 9
stab 9
starin 9
stayin 9
steel 9
stepped 9
stopped 9
styrofoam 9
sucker 9
surface 9
sweater 9
sweatin 9
texts 9
toilet 9
train 9
treated 9
trial 9
tunnel 9
tw 9
tweakin 9
valley 9
video 9
visit 9
walker 9
whipping 9
winner 9
winter 9
wire 9
wishes 9
worked 9
yellin 9
yi 9
zombie 9
adore 8
amazing 8
amen 8
angles 8
apologize 8
asking 8
backpack 8
backwards 8
bake 8
base 8
beauty 8
berry 8
blicky 8
boi 8
boring 8
bows 8
brakes 8
breathin 8
built 8
burning 8
butterfly 8
calliope 8
cared 8
caution 8
center 8
certain 8
challenge 8
changin 8
charlie 8
chauffeur 8
cherry 8
chills 8
chose 8
chuck 8
classic 8
closet 8
cloud 8
cock 8
colors 8
competition 8
complain 8
complainin 8
confused 8
conscience 8
contact 8
copy 8
crime 8
curb 8
curious 8
dale 8
daytrip 8
dealin 8
deck 8
dedicated 8
deliver 8
detroit 8
diet 8
disguise 8
divine 8
doc 8
dolphin 8
dr 8
draft 8
eagle 8
earned 8
earrings 8
ears 8
ed 8
elephant 8
espn 8
extras 8
eyebrows 8
fanta 8
faster 8
fate 8
features 8
felons 8
finessin 8
flapping 8
flavor 8
flesh 8
ford 8
forth 8
fourth 8
fox 8
freaks 8
gambino 8
gay 8
generation 8
gobble 8
grabbed 8
grammys 8
grippin 8
groove 8
gta 8
guarantee 8
guard 8
guts 8
guwop 8
haaan 8
hall 8
halos 8
heal 8
hearts 8
helicopter 8
homeboy 8
honda 8
honestly 8
hook 8
hoping 8
horsepower 8
hotline 8
image 8
issues 8
jamaican 8
jammer 8
jammin 8
jt 8
karate 8
keisha 8
kicks 8
kissing 8
knee 8
knocked 8
knot 8
knots 8
knowledge 8
lap 8
legendary 8
liberated 8
lip 8
listenin 8
loc 8
los 8
lots 8
luôn 8
luxury 8
lying 8
ménage 8
maintain 8
mars 8
matchin 8
matrix 8
melt 8
memories 8
minnesota 8
mommy 8
nat 8
nba 8
nle 8
ooooo 8
oui 8
pan 8
panic 8
parked 8
passin 8
passport 8
paying 8
payroll 8
penthouse 8
pepper 8
percocet 8
personalities 8
pic 8
pistols 8
pluto 8
posed 8
privacy 8
proper 8
puerto 8
racist 8
rainbow 8
randy 8
redfoo 8
religion 8
repeat 8
reply 8
risk 8
robbin 8
rocket 8
rosé 8
roscoe 8
rowdy 8
ruger 8
runway 8
russia 8
sally 8
sand 8
sat 8
screw 8
secret 8
servin 8
shape 8
share 8
shhh 8
silent 8
simply 8
sinkin 8
situation 8
skinned 8
smashin 8
sneakers 8
spare 8
spazzin 8
spending 8
splashin 8
standin 8
stealin 8
stephen 8
stimulated 8
stopping 8
sucking 8
survive 8
tan 8
tennis 8
thicker 8
thottie 8
ti 8
tint 8
tits 8
toby 8
tom 8
tough 8
tree 8
tres 8
tucked 8
twist 8
umm 8
una 8
understood 8
unwanted 8
usin 8
vacay 8
vicious 8
visa 8
vote 8
wana 8
wantin 8
wants 8
wap 8
watched 8
wax 8
wearing 8
whacked 8
wheels 8
whipped 8
won 8
wreck 8
yeezy 8
yule 8
ad 7
advance 7
albums 7
anti 7
apple 7
appreciate 7
arrest 7
asleep 7
assume 7
attack 7
attract 7
backwood 7
bark 7
bear 7
beard 7
belly 7
benihana 7
bentayga 7
bentleys 7
bleedin 7
blocka 7
blu 7
boatload 7
bom 7
boujee 7
bringin 7
brush 7
build 7
bun 7
busting 7
cage 7
camp 7
cases 7
cha 7
changing 7
cheapest 7
cheat 7
checked 7
checking 7
chewed 7
chief 7
chocolate 7
choo 7
choosin 7
choosing 7
christ 7
classy 7
climb 7
clouds 7
clyde 7
como 7
concrete 7
congratulations 7
core 7
corn 7
created 7
cruise 7
crying 7
cubes 7
cuddle 7
cuffin 7
custom 7
dallas 7
danger 7
dave 7
decline 7
demeanor 7
dennis 7
dese 7
distance 7
doe 7
dom 7
dome 7
dre 7
dripped 7
dripping 7
dubai 7
elevator 7
emotion 7
engine 7
english 7
erase 7
expect 7
extendo 7
fades 7
faz 7
fee 7
female 7
figured 7
finding 7
finessed 7
fixed 7
flavored 7
flyer 7
foenem 7
follies 7
forecast 7
forest 7
fours 7
fragrance 7
freedom 7
friendly 7
frozen 7
fumble 7
gate 7
gear 7
giuseppe 7
glover 7
goal 7
godzilla 7
goodbye 7
google 7
gorgeous 7
graduated 7
groovy 7
grra 7
grrah 7
guidance 7
guitar 7
haa 7
haitians 7
hated 7
health 7
heebiejeebies 7
held 7
hips 7
holla 7
horny 7
iana 7
iggy 7
illest 7
intro 7
invite 7
involved 7
iphone 7
iron 7
ironic 7
island 7
islands 7
jeep 7
jets 7
jiggas 7
killas 7
lại 7
laced 7
lack 7
leaf 7
lear 7
lebron 7
legends 7
lessons 7
licky 7
lifetime 7
lighting 7
lingo 7
lipstick 7
listened 7
lobster 7
longest 7
lupe 7
mafia 7
manager 7
march 7
marry 7
mayne 7
mayor 7
memphis 7
mentally 7
mississippi 7
moments 7
monique 7
ms 7
này 7
names 7
nerves 7
newton 7
nikki 7
office 7
orange 7
outfit 7
painted 7
panamera 7
parents 7
parking 7
patrick 7
peeling 7
penny 7
percosex 7
photo 7
photos 7
pieces 7
pillow 7
pimpin 7
pimping 7
plates 7
playa 7
playboy 7
plot 7
polka 7
pops 7
popular 7
posh 7
position 7
potential 7
pounds 7
pouring 7
powder 7
powers 7
practice 7
prayer 7
present 7
pressed 7
project 7
promises 7
punch 7
queens 7
racin 7
rags 7
rapping 7
rare 7
redbone 7
redlyfe 7
reefer 7
regrets 7
repping 7
richard 7
riches 7
romo 7
rot 7
sace 7
scale 7
scammers 7
sea 7
serena 7
settle 7
shadows 7
shakin 7
shaking 7
sharks 7
shook 7
shooting 7
shottas 7
showing 7
shy 7
silicone 7
sk 7
sleeping 7
sloppy 7
slowly 7
smarter 7
snappin 7
snipers 7
social 7
sofa 7
sorrow 7
species 7
spiderman 7
spill 7
spinning 7
steve 7
stolen 7
strange 7
strength 7
sub 7
sucked 7
sunny 7
tables 7
taken 7
tantrum 7
tattoo 7
taxes 7
thief 7
thin 7
thotty 7
threesome 7
throwed 7
timin 7
timmy 7
tommy 7
trapper 7
trey 7
tricking 7
twitter 7
unforgettable 7
untouchable 7
venice 7
vikings 7
visas 7
walls 7
wash 7
whatchu 7
whoop 7
whore 7
wide 7
widow 7
winning 7
witcha 7
wock 7
worker 7
yesterday 7
zonin 7
zoo 7
zoovier 7
ac 6
accept 6
adderall 6
adidas 6
afro 6
agree 6
aimin 6
alley 6
andalé 6
annoying 6
appeal 6
ar 6
artist 6
asian 6
aston 6
attend 6
auntie 6
ave 6
avoid 6
awake 6
awards 6
backbone 6
backed 6
backend 6
badass 6
bail 6
balance 6
balmain 6
balmains 6
ban 6
basically 6
bathroom 6
beamer 6
beating 6
beg 6
bell 6
beyoncé 6
bible 6
bikini 6
bitin 6
blaze 6
bloody 6
bm 6
bogus 6
bonnie 6
booked 6
boot 6
breezy 6
bubblegum 6
budget 6
bug 6
buzz 6
còn 6
calories 6
canada 6
cancel 6
captain 6
ceilin 6
charges 6
charm 6
cheek 6
chew 6
childish 6
chit 6
chopsticks 6
chorus 6
chubby 6
cigarettes 6
claus 6
cnn 6
co 6
coach 6
coca 6
coldest 6
committed 6
compromise 6
consider 6
contigo 6
corners 6
counted 6
county 6
coupes 6
cried 6
criminal 6
crips 6
cuttin 6
dapper 6
dates 6
denim 6
destroy 6
dicks 6
digger 6
ding 6
dis 6
doubted 6
dracos 6
dreads 6
dressin 6
drill 6
driveway 6
dro 6
drought 6
drummers 6
dubs 6
dumpster 6
dutch 6
edge 6
effect 6
ending 6
enemy 6
equal 6
err 6
eve 6
eventful 6
exact 6
exhale 6
feast 6
fever 6
figg 6
fights 6
flawless 6
flights 6
float 6
flops 6
flows 6
formal 6
fortune 6
forward 6
france 6
fuckers 6
fye 6
gain 6
geekin 6
george 6
georgia 6
globe 6
glory 6
gloves 6
goin 6
goofy 6
grain 6
grandpa 6
greece 6
grippy 6
gunna 6
gutter 6
halle 6
handouts 6
handstands 6
heartless 6
hendrix 6
highest 6
hitter 6
holds 6
hollow 6
houses 6
huncho 6
ig 6
inhale 6
interest 6
iverson 6
jag 6
jason 6
joint 6
jon 6
juvy 6
ka 6
keef 6
khaleesi 6
kilos 6
kio 6
kirko 6
ky 6
language 6
latest 6
laughing 6
laws 6
leap 6
learnin 6
lease 6
lee 6
leech 6
lifeguard 6
lift 6
literally 6
location 6
locksmith 6
lyfe 6
một 6
maison 6
margiela 6
marijuana 6
marks 6
master 6
meals 6
meds 6
melly 6
member 6
miles 6
millis 6
mines 6
misses 6
misused 6
mixin 6
monte 6
morphine 6
mumblin 6
muthafucking 6
mvp 6
nas 6
nate 6
nation 6
neighborhood 6
nem 6
ness 6
nick 6
nickel 6
nig 6
nonstop 6
notes 6
noticed 6
nt 6
obsessed 6
ogs 6
ordered 6
ot 6
ounce 6
ovo 6
package 6
packed 6
pad 6
painting 6
passion 6
pastor 6
patrol 6
pause 6
payin 6
penetratin 6
percs 6
perform 6
perky 6
phew 6
picked 6
pie 6
pies 6
pilot 6
planes 6
plaques 6
plead 6
poke 6
poker 6
por 6
porsches 6
president 6
presidential 6
prime 6
princess 6
prints 6
pumps 6
rag 6
ralph 6
rats 6
recognize 6
ref 6
related 6
relaxing 6
remain 6
reporting 6
respond 6
reverend 6
revolvers 6
reyup 6
rhymin 6
righteous 6
robin 6
rollies 6
rope 6
royalty 6
sadness 6
scandalous 6
scott 6
screen 6
seal 6
searching 6
sentence 6
serenity 6
sexual 6
sh 6
shark 6
shed 6
shell 6
sherane 6
shittin 6
shock 6
shockin 6
sicker 6
sis 6
skate 6
skrrr 6
skype 6
slipped 6
slut 6
smilin 6
smoked 6
solar 6
speakers 6
spillin 6
spine 6
spoil 6
spoiled 6
sports 6
sta 6
starts 6
status 6
stiff 6
stole 6
stressing 6
su 6
suge 6
suite 6
swinging 6
switching 6
tame 6
tang 6
tat 6
tattoos 6
teachers 6
tease 6
telly 6
tempt 6
tense 6
texting 6
thrash 6
thugga 6
thugs 6
tick 6
tiger 6
tighten 6
timeless 6
tints 6
tippin 6
tips 6
ton 6
topic 6
totin 6
toxic 6
tracks 6
traumatized 6
trips 6
tru 6
turns 6
twisted 6
twistin 6
underground 6
valentine 6
van 6
vans 6
veins 6
vent 6
vercetti 6
version 6
vibin 6
victim 6
videos 6
villain 6
violence 6
virgin 6
vodka 6
vuitton 6
waves 6
wavy 6
weeks 6
weezy 6
wept 6
wesson 6
whoo 6
willy 6
wished 6
wonderin 6
wore 6
wrists 6
writin 6
wrongs 6
yards 6
yatted 6
yawning 6
yeet 6
yell 6
yelling 6
youngins 6
youtube 6
zero 6
đường 5
aah 5
accent 5
acres 5
adele 5
aka 5
alarm 5
alexander 5
alllll 5
ankles 5
antidote 5
antisocial 5
anxiety 5
aquafina 5
arguing 5
arrested 5
arrive 5
assholes 5
attic 5
aware 5
bên 5
bước 5
balloons 5
bam 5
bans 5
barbies 5
based 5
bath 5
bbw 5
beginnin 5
bench 5
bendin 5
biatch 5
bid 5
billies 5
birdie 5
bitty 5
blatt 5
blink 5
blockin 5
blurry 5
boomin 5
boop 5
boricua 5
borin 5
bosses 5
braggin 5
braids 5
brat 5
breed 5
bridges 5
bs 5
bubba 5
bubble 5
bubbly 5
buddha 5
buddy 5
burned 5
burr 5
bushes 5
busta 5
có 5
cable 5
cancún 5
candle 5
career 5
casket 5
caused 5
cellular 5
certified 5
chapo 5
chariot 5
charts 5
cheddar 5
chewy 5
chinchilla 5
chiraq 5
chrome 5
chronic 5
cities 5
clarity 5
closest 5
cloth 5
clue 5
clutch 5
cockpit 5
cole 5
collar 5
collard 5
collect 5
colored 5
comma 5
common 5
condo 5
connect 5
conquer 5
convo 5
crackin 5
craft 5
crawl 5
creeping 5
cuh 5
curtains 5
dangerously 5
dap 5
dc 5
dealership 5
deals 5
dear 5
definitely 5
definition 5
dentist 5
depart 5
depends 5
desert 5
dinners 5
dish 5
dizzy 5
dms 5
dodgin 5
doll 5
dots 5
doubled 5
draw 5
dreamed 5
dropping 5
drove 5
drowning 5
duckin 5
duffel 5
dunk 5
dutty 5
embed 5
emotionally 5
empire 5
enter 5
excited 5
exciting 5
exotic 5
explain 5
extendos 5
faucet 5
fazed 5
fetty 5
fi 5
fiction 5
fiji 5
fist 5
flavors 5
flo 5
florida 5
floss 5
flowers 5
followers 5
following 5
foods 5
foreplay 5
freakin 5
fries 5
frisbee 5
fronted 5
function 5
funk 5
funky 5
gat 5
gina 5
given 5
glasses 5
glitter 5
gmail 5
goat 5
goon 5
greens 5
grey 5
grits 5
grizz 5
growing 5
grows 5
grrra 5
grrt 5
guest 5
guilty 5
hammers 5
handsome 5
hatred 5
headshots 5
heater 5
hee 5
hehe 5
hiding 5
highs 5
hockey 5
hoodie 5
hooked 5
hopping 5
horn 5
horses 5
hunnids 5
ideas 5
immortal 5
impatient 5
imperfection 5
inches 5
indians 5
ink 5
intentions 5
introduced 5
iv 5
janey 5
jenner 5
jeweler 5
jocking 5
joe 5
johnny 5
join 5
journey 5
junkie 5
karma 5
không 5
kidney 5
killa 5
kings 5
kisses 5
kite 5
labels 5
landing 5
laughed 5
lauren 5
lauryn 5
laying 5
leaned 5
letting 5
lifesaver 5
likes 5
limits 5
links 5
lion 5
liter 5
litty 5
loaf 5
loan 5
local 5
logo 5
loser 5
loss 5
louder 5
lounge 5
lyricsi 5
machine 5
madman 5
madness 5
malcolm 5
marathon 5
marie 5
marvin 5
matching 5
mavericks 5
mcqueen 5
melody 5
merry 5
messed 5
messy 5
meyou 5
midas 5
migos 5
minds 5
minus 5
mistakes 5
mitch 5
mobbin 5
monkey 5
monty 5
morn 5
moscato 5
motivated 5
mournin 5
mouths 5
mozart 5
murk 5
naughty 5
nearly 5
nelson 5
netflix 5
nipsey 5
nissan 5
non 5
nova 5
obama 5
od 5
odds 5
oil 5
omen 5
ooo 5
oooh 5
opposite 5
oscar 5
overdosed 5
panty 5
paraguay 5
paranoia 5
parkin 5
passenger 5
pauls 5
payment 5
peach 5
peanut 5
pg 5
phase 5
philippe 5
phony 5
physically 5
pile 5
pillies 5
pitching 5
pity 5
players 5
porn 5
prayed 5
precious 5
prescriptions 5
presidents 5
prom 5
pu 5
pudding 5
purp 5
purses 5
pushing 5
pussies 5
quicker 5
races 5
raf 5
rainy 5
rambo 5
raps 5
realize 5
relax 5
release 5
renegade 5
rental 5
rerock 5
ri 5
rican 5
rico 5
rides 5
ridiculous 5
rim 5
riot 5
roarin 5
roller 5
rovers 5
rubbin 5
ruler 5
sẽ 5
saints 5
sales 5
salty 5
scarred 5
schemin 5
scorin 5
search 5
sewed 5
shells 5
shift 5
simons 5
skipped 5
slapped 5
sleeves 5
smellin 5
smiles 5
snitchin 5
sonic 5
sons 5
sorta 5
southwest 5
spades 5
spain 5
sparkin 5
speedin 5
spitting 5
splash 5
spoke 5
stamina 5
states 5
stinking 5
straps 5
stroke 5
struggles 5
sue 5
suicides 5
survoler 5
swagger 5
swagging 5
switched 5
tú 5
tab 5
tags 5
target 5
tells 5
tetris 5
thankin 5
thigh 5
thirteen 5
thong 5
thrill 5
thumb 5
timeline 5
tire 5
tissue 5
tolerate 5
toolie 5
topless 5
totally 5
traded 5
traduzione 5
trailer 5
trance 5
truancy 5
trucks 5
turbo 5
undercover 5
unknown 5
upper 5
uptown 5
usual 5
vault 5
veces 5
vet 5
vida 5
vogue 5
waitress 5
warn 5
wasting 5
waters 5
web 5
weighin 5
westin 5
westside 5
wondering 5
worthwhile 5
xanny 5
yao 5
yeahyou 5
yola 5
zest 5
