like 980
got 703
yeah 605
know 566
nigga 444
ai 363
bitch 340
way 336
love 334
uh 300
wanna 282
let 279
shit 279
fuck 261
niggas 257
baby 250
oh 241
ayy 238
girl 231
ya 224
time 221
man 218
come 217
ooh 207
life 199
ass 195
need 195
want 193
gon 191
right 188
money 180
yo 178
tell 167
hey 149
said 149
bitches 147
lyrics 146
real 144
day 143
good 139
think 137
legit 134
huh 131
wake 130
ta 129
feel 127
gettin 120
hit 118
bad 114
na 112
fuckin 111
run 110
hoes 108
big 103
head 101
wo 101
night 99
high 98
little 98
turn 97
better 95
look 95
live 93
play 91
b 88
hot 85
new 83
o 82
chick 80
til 80
crazy 79
dem 79
ah 78
pussy 78
cause 76
ho 76
la 76
tryna 76
watch 76
quit 75
shake 73
game 72
long 72
god 71
mind 71
stop 71
woo 71
boy 69
everybody 69
feelin 69
lil 68
mama 68
yi 68
damn 67
home 67
check 65
club 65
dance 65
hard 65
low 65
die 64
mi 64
roll 64
things 64
hol 63
beat 62
bump 62
fire 62
ha 62
di 61
believe 60
girls 59
fall 57
pumps 57
ride 56
hands 55
miss 55
shorty 55
touch 55
getting 54
nah 54
try 54
bone 53
dick 53
young 53
body 52
hold 52
swerve 52
hear 51
black 50
came 50
inside 50
pop 50
work 50
face 49
going 49
rap 49
bring 48
drop 48
kick 48
light 48
livin 48
poo 48
yuh 48
mad 47
mean 47
talk 47
wait 47
world 47
yes 47
away 46
bang 46
find 46
knock 45
mediocre 45
pull 45
ball 44
biggie 44
blow 44
dat 44
dog 44
left 44
okay 44
shot 44
thing 44
addams 43
leave 43
shook 43
street 43
gyal 42
sit 42
smoke 42
straight 42
da 41
dreams 41
house 41
thug 41
understand 41
kill 40
lookin 40
people 40
start 40
told 40
care 39
cold 39
motherfuckin 39
word 39
wrong 39
crossroads 38
pay 38
relax 38
settle 38
stay 38
twerk 38
bit 37
clothes 37
drank 37
gone 37
lot 37
swear 37
ayyy 36
brain 36
cash 36
city 36
deep 36
g 36
heard 36
party 36
change 35
eyes 35
floor 35
friend 35
insane 35
lord 35
men 35
p 35
talkin 35
bed 34
hand 34
li 34
monster 34
playin 34
whistle 34
badder 33
comin 33
crack 33
gangster 33
gun 33
hell 33
pac 33
pass 33
ready 33
rich 33
shoot 33
short 33
streets 33
tryin 33
walk 33
wish 33
boogie 32
dead 32
hood 32
listen 32
miya 32
outta 32
save 32
school 32
seen 32
style 32
thought 32
times 32
block 31
broke 31
buck 31
bust 31
family 31
sayin 31
set 31
tonight 31
tried 31
wrote 31
yang 31
car 30
chase 30
cut 30
dollar 30
eat 30
fine 30
heart 30
hope 30
lit 30
looking 30
month 30
number 30
round 30
track 30
catch 29
forever 29
friends 29
gang 29
ie 29
makin 29
naked 29
phone 29
rock 29
ruggish 29
sure 29
throw 29
thuggish 29
took 29
white 29
wid 29
ying 29
york 29
end 28
flow 28
fucked 28
guess 28
king 28
mouth 28
pray 28
takin 28
talking 28
waan 28
wet 28
wishin 28
act 27
break 27
motherfucker 27
old 27
open 27
smell 27
wonder 27
bish 26
close 26
cool 26
daughter 26
fi 26
fight 26
gave 26
goes 26
mask 26
paid 26
rhyme 26
roses 26
shawty 26
sweet 26
thang 26
wit 26
ye 26
air 25
benz 25
checks 25
fat 25
kid 25
smile 25
soon 25
sound 25
tip 25
area 24
buy 24
coast 24
crew 24
dream 24
lights 24
lose 24
matter 24
pain 24
peace 24
place 24
quick 24
rappers 24
sex 24
son 24
songs 24
started 24
woman 24
words 24
boo 23
comes 23
foot 23
fucking 23
hair 23
half 23
hate 23
late 23
step 23
wifey 23
ask 22
best 22
born 22
caught 22
codes 22
cry 22
d 22
dirty 22
fast 22
fool 22
ice 22
ladies 22
line 22
molly 22
nice 22
player 22
shots 22
sorry 22
suh 22
sun 22
thugs 22
wall 22
women 22
ayo 21
blunt 21
daddy 21
death 21
east 21
fame 21
feeling 21
hail 21
hammer 21
hits 21
mercy 21
percocets 21
pool 21
poppin 21
runnin 21
salt 21
saved 21
thinkin 21
went 21
yoo 21
ballin 20
bong 20
different 20
dough 20
ghetto 20
gold 20
holy 20
kids 20
knows 20
lady 20
m 20
mary 20
meet 20
million 20
ohh 20
pretty 20
slow 20
test 20
true 20
war 20
boyz 19
chest 19
dark 19
dna 19
door 19
far 19
finger 19
fly 19
gimme 19
humble 19
knew 19
lie 19
paper 19
pound 19
remember 19
ring 19
scared 19
slap 19
sleep 19
song 19
stand 19
trip 19
ways 19
barbie 18
child 18
deal 18
drive 18
feed 18
hang 18
lay 18
liquor 18
lost 18
loud 18
main 18
queens 18
rest 18
rip 18
room 18
somebody 18
soul 18
weed 18
wi 18
window 18
worth 18
apologize 17
bands 17
bought 17
burn 17
days 17
easy 17
everyday 17
honey 17
hop 17
hopin 17
illusions 17
jump 17
met 17
pick 17
picture 17
pon 17
poor 17
power 17
rain 17
rollin 17
saying 17
shaker 17
skrrt 17
spot 17
teeth 17
town 17
trap 17
wanted 17
blood 16
candy 16
crooked 16
cup 16
dope 16
fake 16
help 16
kiss 16
l 16
later 16
lisa 16
living 16
loving 16
maybe 16
motherfuckers 16
music 16
past 16
plan 16
press 16
shimmy 16
special 16
stuff 16
thick 16
years 16
boom 15
bottle 15
bound 15
bout 15
brother 15
brothers 15
cars 15
cell 15
chill 15
diamonds 15
fact 15
father 15
feels 15
feet 15
follow 15
gas 15
grab 15
green 15
hypnotize 15
jackson 15
killed 15
lean 15
meant 15
mom 15
mother 15
pack 15
pimp 15
poppa 15
rep 15
represent 15
road 15
safe 15
seat 15
sell 15
sick 15
skeet 15
sky 15
spit 15
thousand 15
treat 15
trust 15
ugh 15
alright 14
bus 14
cane 14
changed 14
cover 14
crunk 14
dawg 14
dollars 14
ear 14
fans 14
flame 14
foreigns 14
forget 14
free 14
goddamn 14
hatin 14
jesus 14
kinda 14
lifestyle 14
lonely 14
makes 14
mo 14
movie 14
murder 14
pen 14
piece 14
playing 14
point 14
pour 14
probably 14
punk 14
range 14
remy 14
ridin 14
rockstar 14
running 14
sing 14
smokin 14
speak 14
switch 14
twice 14
waitin 14
wave 14
west 14
woah 14
actin 13
brooklyn 13
certain 13
chance 13
cocaine 13
crib 13
drivin 13
dumb 13
ego 13
fo 13
gets 13
haters 13
hennessy 13
inna 13
jus 13
k 13
knees 13
mirror 13
neck 13
ones 13
plus 13
po 13
puff 13
reppin 13
roof 13
seh 13
sip 13
skin 13
spend 13
star 13
state 13
stick 13
store 13
sweat 13
texas 13
trillion 13
use 13
weak 13
wide 13
wine 13
workin 13
asked 12
bentley 12
bite 12
blame 12
bottles 12
bounce 12
buildin 12
butt 12
cheeks 12
closer 12
cops 12
dive 12
double 12
drink 12
drugs 12
early 12
faded 12
fart 12
foreign 12
freak 12
funky 12
goosebumps 12
guy 12
heaven 12
hills 12
hip 12
holla 12
homie 12
jack 12
jewelry 12
job 12
keepin 12
lambo 12
mc 12
membrane 12
mic 12
minute 12
mona 12
morn 12
mornin 12
named 12
nuh 12
phife 12
played 12
pole 12
police 12
pow 12
promise 12
raise 12
red 12
rover 12
shallow 12
shame 12
sippin 12
stank 12
stars 12
stuck 12
suck 12
t 12
taking 12
thank 12
thirsty 12
ting 12
titties 12
vibe 12
weh 12
zoowap 12
askin 11
aw 11
babies 11
bank 11
beam 11
bill 11
bling 11
blown 11
blue 11
boys 11
case 11
clap 11
cocked 11
code 11
coming 11
creep 11
crime 11
devil 11
e 11
fill 11
finna 11
fore 11
forgot 11
fresh 11
gnashin 11
guns 11
haffi 11
homies 11
hustle 11
hype 11
lamborghini 11
level 11
loose 11
louis 11
moment 11
pants 11
perfect 11
pocket 11
queen 11
question 11
questions 11
raised 11
reach 11
reason 11
reminisce 11
s 11
saucin 11
saw 11
shine 11
squad 11
steady 11
story 11
stunt 11
tequila 11
thinking 11
today 11
trees 11
walkin 11
weepin 11
aww 10
ba 10
bein 10
brought 10
brr 10
called 10
class 10
clean 10
confusion 10
control 10
countin 10
cross 10
drama 10
ed 10
eye 10
feelings 10
fell 10
fish 10
flashy 10
found 10
funk 10
glock 10
grown 10
happy 10
hurt 10
ill 10
instead 10
jerk 10
kendrick 10
kept 10
kong 10
lame 10
laugh 10
law 10
mix 10
popping 10
realize 10
record 10
rent 10
representin 10
respect 10
rules 10
scenario 10
scream 10
sellin 10
send 10
shakin 10
shout 10
slip 10
storm 10
stretch 10
swaggin 10
thigh 10
till 10
tomorrow 10
touchin 10
type 10
wack 10
week 10
yea 10
acting 9
album 9
alcohol 9
alive 9
average 9
bag 9
balls 9
beautiful 9
bend 9
bet 9
booty 9
bows 9
box 9
brush 9
bullets 9
business 9
bustin 9
bye 9
cadillac 9
callin 9
champagne 9
cheese 9
cliché 9
cocoa 9
concert 9
corner 9
count 9
crowd 9
eatin 9
ends 9
exercise 9
field 9
folks 9
future 9
games 9
gat 9
haha 9
happen 9
heat 9
hee 9
hittin 9
honeys 9
hort 9
hug 9
hustlin 9
jeans 9
killer 9
lettin 9
luv 9
mack 9
mami 9
michael 9
migraine 9
moanin 9
mon 9
movin 9
n 9
needed 9
neighborhood 9
news 9
ocean 9
players 9
plenty 9
pockets 9
posted 9
princess 9
psycho 9
raw 9
rhymes 9
rough 9
sexy 9
shows 9
sign 9
singin 9
single 9
spendin 9
stress 9
strong 9
stupid 9
sunrise 9
supposed 9
swingin 9
taste 9
tellin 9
thanks 9
tight 9
toes 9
tribe 9
trouble 9
truth 9
trying 9
turned 9
turnt 9
water 9
wear 9
whip 9
x 9
year 9
zone 9
ak 8
anybody 8
apart 8
ay 8
bando 8
battle 8
beatin 8
beef 8
bills 8
blowin 8
blunts 8
boss 8
bowl 8
bread 8
bub 8
c 8
chain 8
changes 8
chopper 8
couple 8
crash 8
cuz 8
damage 8
drinkin 8
dutty 8
ease 8
explode 8
fancy 8
fit 8
flex 8
fun 8
girlfriend 8
glass 8
glue 8
goodnight 8
gossip 8
hangin 8
harder 8
higher 8
hole 8
hotline 8
hour 8
hu 8
hunnid 8
juice 8
junior 8
keys 8
known 8
leaking 8
letter 8
lyrical 8
madness 8
mall 8
momma 8
motherfucking 8
moves 8
nelly 8
north 8
nut 8
opportunity 8
pad 8
palm 8
passed 8
patiently 8
perms 8
pills 8
post 8
pressure 8
puttin 8
quarter 8
read 8
reality 8
relate 8
renee 8
rewind 8
rhythm 8
rocks 8
rolled 8
rubbed 8
screamin 8
sh 8
shady 8
shirt 8
shoes 8
shootin 8
sight 8
signed 8
sister 8
snatch 8
soaking 8
sold 8
space 8
strap 8
super 8
sweeper 8
tape 8
telling 8
thoughts 8
tree 8
tv 8
uncle 8
vacation 8
verse 8
warm 8
warning 8
wife 8
wood 8
afraid 7
ap 7
appreciated 7
aquemini 7
babe 7
barely 7
barrel 7
bars 7
bird 7
birthday 7
bloodshot 7
blowing 7
breath 7
bucks 7
champion 7
cheapest 7
checkin 7
chicks 7
children 7
church 7
cock 7
color 7
compton 7
core 7
couch 7
cousin 7
crossed 7
cyaan 7
dare 7
def 7
diss 7
drake 7
dress 7
drinking 7
dropped 7
drunk 7
duck 7
facts 7
faith 7
fed 7
filled 7
finish 7
fix 7
food 7
freaky 7
funny 7
gah 7
gots 7
grail 7
grand 7
grind 7
guard 7
guys 7
h 7
headed 7
heavy 7
holdin 7
homeboy 7
honest 7
ink 7
jail 7
key 7
killing 7
kitchen 7
knocked 7
knowin 7
learn 7
legs 7
lick 7
lines 7
list 7
lives 7
mafia 7
magic 7
making 7
mamas 7
married 7
near 7
nicki 7
nod 7
note 7
outside 7
peep 7
pistol 7
powers 7
profit 7
ran 7
rapper 7
records 7
reverend 7
riches 7
riding 7
rule 7
sack 7
second 7
seven 7
simple 7
slim 7
smalls 7
south 7
speed 7
stage 7
standin 7
stayin 7
steal 7
stronger 7
struggle 7
tears 7
temperature 7
tired 7
tony 7
tour 7
trippin 7
twins 7
v 7
victim 7
wants 7
waste 7
wastin 7
watchin 7
wayne 7
wheeling 7
whippin 7
wild 7
worse 7
wrist 7
y 7
yawk 7
yellow 7
zoovier 7
ahh 6
aight 6
angel 6
arms 6
attack 6
bada 6
bail 6
bangin 6
bar 6
beginnin 6
berry 6
billy 6
boatload 6
bom 6
bop 6
brand 6
bright 6
broads 6
brown 6
bun 6
cake 6
cana 6
card 6
carpet 6
cat 6
chasin 6
chrome 6
clear 6
clique 6
clock 6
commas 6
cookin 6
cop 6
corn 6
cost 6
dad 6
dave 6
de 6
dear 6
dig 6
dirt 6
donna 6
dot 6
drug 6
dub 6
dubs 6
dyin 6
ex 6
extra 6
familiar 6
faux 6
fendi 6
finally 6
flesh 6
flexin 6
flip 6
flock 6
gangsta 6
gats 6
givin 6
goal 6
godzilla 6
grip 6
grits 6
guilty 6
hearts 6
hide 6
hoods 6
hungry 6
hypnotic 6
ignite 6
iverson 6
jah 6
jam 6
kickin 6
land 6
lane 6
lanes 6
leather 6
lemme 6
lies 6
lifetime 6
limelight 6
locked 6
longer 6
loot 6
ménage 6
marley 6
mars 6
memories 6
message 6
middle 6
mil 6
mistake 6
mood 6
mothafucka 6
names 6
nasty 6
nuts 6
papa 6
passin 6
payin 6
pies 6
pose 6
pourin 6
prayin 6
price 6
pro 6
pump 6
push 6
racks 6
regular 6
rings 6
rocking 6
satan 6
secret 6
self 6
sent 6
servin 6
shade 6
sheesh 6
shelter 6
sherane 6
shinin 6
signs 6
sisters 6
sitting 6
smack 6
snow 6
soda 6
soft 6
spray 6
support 6
sweatin 6
swimming 6
swing 6
tactics 6
tear 6
thuggin 6
tragic 6
train 6
tune 6
twist 6
u 6
ultralight 6
unh 6
voices 6
waist 6
weekend 6
weight 6
wiggle 6
win 6
winner 6
won 6
worried 6
add 5
aha 5
asking 5
attention 5
baddest 5
beard 5
beg 5
behavior 5
belt 5
bleed 5
bless 5
blew 5
bodies 5
boulevard 5
bouncin 5
bow 5
brighter 5
bruce 5
bullshit 5
busy 5
cab 5
cah 5
calm 5
canibus 5
caroline 5
cats 5
certified 5
chaser 5
chevy 5
christmas 5
chronic 5
clair 5
cleveland 5
click 5
coke 5
coupe 5
coups 5
court 5
credit 5
crush 5
curtain 5
damsel 5
dash 5
date 5
deserve 5
dial 5
diddy 5
disrespect 5
dogs 5
dome 5
don 5
doubt 5
dre 5
dread 5
droppin 5
dust 5
easier 5
eazy 5
em 5
emotion 5
enemies 5
eventually 5
evil 5
exactly 5
excuse 5
explain 5
fakin 5
fate 5
fault 5
fear 5
female 5
fiends 5
fifth 5
flaunt 5
flight 5
forgive 5
fourth 5
freaks 5
frontin 5
gal 5
golden 5
great 5
grill 5
halle 5
hallelujah 5
hater 5
headshots 5
heels 5
hello 5
highest 5
hoe 5
hollywood 5
hours 5
important 5
itch 5
j 5
jeeps 5
jon 5
jordans 5
keeps 5
killin 5
kind 5
lasts 5
lead 5
leavin 5
lex 5
lou 5
loves 5
lyin 5
mackin 5
makeup 5
march 5
mavericks 5
means 5
mental 5
midwest 5
mighty 5
millions 5
misery 5
mission 5
mmm 5
mob 5
moms 5
moon 5
normal 5
notch 5
numbers 5
oakland 5
og 5
onyx 5
order 5
ounce 5
outlaw 5
par 5
paying 5
percent 5
petty 5
pink 5
pipe 5
piss 5
plastic 5
playa 5
poison 5
pot 5
praise 5
prison 5
projects 5
prolly 5
provide 5
punks 5
racin 5
rappin 5
ray 5
regret 5
reputation 5
rise 5
roc 5
rockin 5
role 5
rub 5
rump 5
savage 5
scene 5
scratch 5
screen 5
secrets 5
sendin 5
serve 5
sewed 5
share 5
shoulda 5
shoulder 5
shut 5
silly 5
slang 5
slangin 5
slay 5
sleepin 5
sleet 5
slide 5
slingin 5
smoking 5
sniper 5
spent 5
spread 5
stack 5
staring 5
stash 5
stayed 5
steel 5
steps 5
strength 5
stripper 5
stuntin 5
sugar 5
sweater 5
takes 5
tall 5
tap 5
teach 5
team 5
tender 5
text 5
tha 5
thirty 5
tints 5
toast 5
tool 5
toss 5
trailer 5
triple 5
truck 5
tunechi 5
usin 5
usual 5
uzi 5
verses 5
vex 5
visit 5
voice 5
waiting 5
walking 5
wantin 5
weeks 5
westside 5
wheel 5
wind 5
woke 5
worry 5
worst 5
wreck 5
yah 5
yayo 5
yee 5
yelling 5
yer 5
