like 356
yeah 331
got 272
know 217
ayy 160
bitch 139
ai 137
baby 133
ooh 133
way 132
nigga 127
fuck 123
niggas 96
shit 96
love 89
need 88
ass 83
let 83
wanna 80
night 77
want 75
time 73
uh 73
man 71
life 70
girl 62
hol 61
feel 60
gon 60
said 60
fuckin 59
high 58
ya 56
lyrics 53
o 53
oh 53
feelin 52
lil 52
think 52
money 51
swerve 51
woo 51
bitches 49
ta 49
tell 49
tryna 49
b 46
god 46
hit 46
big 45
look 45
low 45
la 44
wo 44
real 43
come 41
turn 40
right 39
bad 38
good 38
drank 37
home 37
day 36
monster 34
everybody 33
sit 33
getting 31
play 31
dreams 30
hey 30
believe 29
chase 28
dog 28
head 28
pop 28
gang 27
inside 27
na 27
save 27
bish 26
hold 26
swear 26
things 26
watch 26
wishin 26
ye 26
yo 26
young 26
better 25
gettin 25
hard 25
huh 25
left 25
mask 25
rap 25
mind 24
playin 24
pussy 24
shot 24
boy 23
damn 23
going 23
hoes 23
crazy 22
hands 22
light 22
mean 22
pull 22
shoot 22
bang 21
city 21
deep 21
molly 21
nah 21
okay 21
percocets 21
wifey 21
yoo 21
drop 20
fall 20
lookin 20
new 20
ride 20
roll 20
saved 20
yes 20
dna 19
run 19
straight 19
ballin 18
came 18
change 18
dance 18
mama 18
round 18
sayin 18
songs 18
sound 18
thing 18
til 18
ah 17
barbie 17
game 17
ho 17
motherfuckin 17
pool 17
rappers 17
bands 16
face 16
gun 16
hand 16
house 16
humble 16
little 16
livin 16
long 16
miss 16
shots 16
talk 16
bound 15
check 15
king 15
liquor 15
old 15
open 15
rep 15
ring 15
seen 15
set 15
start 15
stop 15
teeth 15
trap 15
work 15
bring 14
car 14
cause 14
foreigns 14
girls 14
lit 14
mad 14
main 14
rockstar 14
seat 14
sun 14
talkin 14
wake 14
window 14
block 13
cane 13
comes 13
cool 13
crooked 13
dirty 13
hope 13
kill 13
people 13
phone 13
poppin 13
power 13
remy 13
skrrt 13
smile 13
smoke 13
stand 13
thousand 13
act 12
black 12
boyz 12
brain 12
diamonds 12
dive 12
dollar 12
ego 12
fans 12
finger 12
friends 12
goosebumps 12
hear 12
lambo 12
late 12
lifestyle 12
lord 12
mouth 12
outta 12
press 12
reppin 12
rich 12
roof 12
room 12
shallow 12
started 12
wait 12
white 12
zoowap 12
beat 11
blood 11
blow 11
body 11
candy 11
cell 11
chick 11
cocaine 11
comin 11
find 11
fine 11
foreign 11
forever 11
fucked 11
gas 11
gnashin 11
hell 11
hills 11
killed 11
leave 11
lot 11
music 11
pain 11
safe 11
saucin 11
school 11
stay 11
sure 11
thinkin 11
thirsty 11
times 11
walk 11
weepin 11
wine 11
wonder 11
ball 10
bentley 10
blown 10
buy 10
caught 10
changed 10
countin 10
cup 10
daughter 10
dick 10
die 10
door 10
eyes 10
faded 10
fire 10
gave 10
help 10
jerk 10
jewelry 10
lamborghini 10
lose 10
mercy 10
moment 10
mornin 10
movie 10
pass 10
rock 10
star 10
swaggin 10
switch 10
texas 10
thought 10
took 10
ba 9
bling 9
brr 9
club 9
concert 9
cut 9
dead 9
different 9
dream 9
eat 9
end 9
exercise 9
feed 9
floor 9
fool 9
goddamn 9
goes 9
half 9
ice 9
jesus 9
knows 9
kong 9
loud 9
louis 9
migraine 9
million 9
moanin 9
number 9
ones 9
peace 9
perfect 9
pick 9
pretty 9
son 9
song 9
soon 9
style 9
takin 9
taking 9
throw 9
told 9
touch 9
touchin 9
trip 9
trust 9
went 9
actin 8
apart 8
bed 8
broke 8
chance 8
chopper 8
dollars 8
drive 8
fat 8
fore 8
gone 8
gossip 8
happen 8
hennessy 8
higher 8
hood 8
hop 8
hotline 8
hunnid 8
kendrick 8
line 8
maybe 8
motherfucker 8
movin 8
neck 8
opportunity 8
pockets 8
pour 8
queen 8
representin 8
ridin 8
road 8
sky 8
somebody 8
sorry 8
spend 8
thick 8
tried 8
try 8
tryin 8
turnt 8
women 8
world 8
ap 7
bando 7
barely 7
beam 7
beautiful 7
bottle 7
bottles 7
bullets 7
champagne 7
cheapest 7
clap 7
cold 7
crib 7
dumb 7
fame 7
fly 7
friend 7
fucking 7
hatin 7
heard 7
homies 7
hot 7
jump 7
kids 7
lame 7
lettin 7
looking 7
murder 7
nicki 7
nod 7
place 7
plan 7
pray 7
probably 7
profit 7
psycho 7
sex 7
shows 7
singin 7
sip 7
slow 7
squad 7
sweet 7
track 7
twice 7
woah 7
wrote 7
yawk 7
zoovier 7
air 6
alright 6
ask 6
ayo 6
bank 6
boatload 6
bop 6
bout 6
break 6
buildin 6
care 6
champion 6
code 6
compton 6
core 6
cost 6
d 6
dope 6
drake 6
dress 6
drink 6
drinkin 6
ease 6
fact 6
faith 6
fake 6
far 6
feelings 6
fill 6
foot 6
forgot 6
free 6
future 6
godzilla 6
gold 6
ha 6
headed 6
heart 6
holdin 6
honey 6
iverson 6
k 6
kiss 6
lick 6
lifetime 6
list 6
listen 6
live 6
met 6
michael 6
north 6
party 6
pay 6
pills 6
pistol 6
pound 6
pow 6
powers 6
promise 6
rain 6
reality 6
red 6
remember 6
riding 6
rollin 6
sell 6
shame 6
sherane 6
shootin 6
single 6
sleep 6
smokin 6
special 6
spendin 6
stretch 6
stuck 6
swimming 6
tony 6
tragic 6
ultralight 6
vacation 6
voices 6
wanted 6
war 6
weak 6
whip 6
whippin 6
wrist 6
year 6
asked 5
beginnin 5
berry 5
best 5
bill 5
bird 5
blunt 5
born 5
boss 5
bought 5
bowl 5
box 5
breath 5
broads 5
brothers 5
bus 5
bust 5
carpet 5
case 5
catch 5
chevy 5
close 5
color 5
control 5
cookin 5
corn 5
dash 5
dave 5
diddy 5
dough 5
duck 5
eatin 5
ed 5
ex 5
fast 5
father 5
finna 5
flock 5
flow 5
g 5
games 5
grand 5
hair 5
halle 5
hallelujah 5
hate 5
headshots 5
highest 5
hopin 5
kept 5
key 5
kid 5
lanes 5
level 5
madness 5
mall 5
march 5
mavericks 5
normal 5
palm 5
pies 5
pocket 5
poison 5
pourin 5
projects 5
prolly 5
racks 5
reason 5
reputation 5
rewind 5
runnin 5
satan 5
savage 5
scream 5
sellin 5
shade 5
shirt 5
shorty 5
sick 5
skin 5
slap 5
sniper 5
soda 5
soul 5
speak 5
spit 5
street 5
tired 5
tonight 5
trailer 5
usin 5
usual 5
v 5
wantin 5
watchin 5
wave 5
weekend 5
wet 5
won 5
word 5
workin 5
worried 5
worth 5
wrong 5
yee 5
