like 347
got 216
know 205
nigga 171
yeah 158
love 145
bitch 138
uh 134
oh 121
let 114
way 106
wanna 98
girl 92
ai 91
shit 91
ooh 84
niggas 80
ass 78
dem 76
need 76
right 76
chick 74
fuck 73
yi 68
tell 67
hot 66
baby 65
hoes 65
yo 65
mi 64
bitches 63
day 62
come 61
di 60
good 60
money 59
ah 58
gon 58
want 58
feel 57
ya 56
man 55
o 55
think 55
club 54
time 54
gettin 53
look 50
shake 50
swerve 50
til 50
turn 50
lyrics 49
pussy 49
fuckin 48
head 46
b 44
bad 44
dat 43
ayy 42
gyal 42
huh 41
yuh 41
believe 40
hey 40
new 40
real 40
god 39
na 39
beat 38
twerk 38
body 36
ho 36
better 34
monster 34
badder 33
crazy 33
fall 33
hands 33
said 33
little 32
long 32
okay 32
yang 31
boy 30
li 30
motherfuckin 30
party 30
stop 30
tryna 30
watch 30
dick 29
ie 29
life 29
wid 29
ying 29
naked 28
p 28
waan 28
ball 27
clothes 27
everybody 27
hit 27
miss 27
floor 26
fi 25
rap 25
ha 24
light 24
street 24
york 24
area 22
codes 22
damn 22
girls 22
shawty 22
suh 22
talk 22
whistle 22
bed 21
care 21
face 21
heart 21
high 21
live 21
lookin 21
nah 21
wish 21
yoo 21
big 20
bit 20
cold 20
dance 20
home 20
lord 20
mercy 20
run 20
salt 20
thang 20
wait 20
bang 19
game 19
leave 19
men 19
roll 19
start 19
tonight 19
cause 18
drop 18
holy 18
looking 18
lose 18
mean 18
ta 18
told 18
wi 18
woo 18
death 17
find 17
matter 17
shaker 17
fame 16
foot 16
gimme 16
mind 16
pon 16
ride 16
shimmy 16
track 16
work 16
away 15
bound 15
friends 15
getting 15
lit 15
m 15
outta 15
play 15
pop 15
skeet 15
walk 15
wall 15
woman 15
yes 15
boo 14
came 14
city 14
comes 14
crunk 14
flow 14
gun 14
hear 14
hood 14
lisa 14
listen 14
lot 14
motherfucker 14
people 14
shot 14
sound 14
teeth 14
wet 14
world 14
benz 13
black 13
blow 13
coast 13
d 13
dead 13
dream 13
fight 13
going 13
heard 13
house 13
inna 13
jus 13
lights 13
lil 13
low 13
night 13
pay 13
seh 13
touch 13
tryin 13
white 13
wrong 13
bring 12
chest 12
dollar 12
end 12
eyes 12
fart 12
feelin 12
goes 12
mona 12
mouth 12
nuh 12
past 12
range 12
ready 12
scared 12
seat 12
smoke 12
ting 12
waitin 12
weh 12
young 12
catch 11
die 11
early 11
fire 11
friend 11
gnashin 11
gold 11
haffi 11
hard 11
king 11
lambo 11
lamborghini 11
left 11
mad 11
million 11
morn 11
music 11
pass 11
pound 11
rich 11
takin 11
talkin 11
things 11
thirsty 11
weepin 11
wo 11
worth 11
bite 10
easy 10
fast 10
feels 10
hair 10
half 10
hold 10
inside 10
jerk 10
jesus 10
l 10
loud 10
mirror 10
mom 10
moment 10
mornin 10
number 10
questions 10
rover 10
set 10
shoot 10
streets 10
stuff 10
times 10
wit 10
beam 9
best 9
born 9
bottle 9
bought 9
bows 9
cadillac 9
cocoa 9
concert 9
dark 9
different 9
eat 9
field 9
fine 9
fucking 9
gone 9
hand 9
hell 9
honey 9
ice 9
knees 9
knows 9
ladies 9
makin 9
mami 9
met 9
moanin 9
mon 9
open 9
save 9
sex 9
shakin 9
skin 9
talking 9
thanks 9
thinkin 9
took 9
treat 9
try 9
walkin 9
west 9
blood 8
blue 8
booty 8
caught 8
certain 8
chance 8
check 8
cliché 8
cocked 8
crack 8
daughter 8
deep 8
dreams 8
dutty 8
fo 8
guess 8
hang 8
holla 8
hope 8
hurt 8
hype 8
keepin 8
leaking 8
lie 8
lost 8
nelly 8
opportunity 8
pain 8
patiently 8
perms 8
phone 8
picture 8
playin 8
pole 8
poppin 8
puff 8
pull 8
rip 8
school 8
sexy 8
shorty 8
soaking 8
stay 8
style 8
sweeper 8
swingin 8
thigh 8
titties 8
understand 8
wanted 8
war 8
warning 8
woah 8
act 7
alcohol 7
apologize 7
babe 7
beautiful 7
bill 7
bub 7
bus 7
cash 7
champion 7
comin 7
cyaan 7
e 7
east 7
father 7
feed 7
feeling 7
flame 7
found 7
glue 7
grail 7
guy 7
haters 7
hatin 7
help 7
hug 7
job 7
kid 7
killer 7
kiss 7
knock 7
line 7
louis 7
mama 7
meet 7
old 7
popping 7
power 7
profit 7
round 7
rubbed 7
sayin 7
seen 7
sleep 7
smile 7
somebody 7
son 7
soul 7
speak 7
special 7
stick 7
storm 7
straight 7
temperature 7
thing 7
till 7
tip 7
trees 7
trip 7
turned 7
twins 7
vibe 7
warm 7
wheeling 7
x 7
asked 6
bada 6
beatin 6
beginnin 6
billy 6
birthday 6
break 6
buildin 6
bust 6
cana 6
car 6
cheese 6
color 6
cool 6
cover 6
crowd 6
cry 6
cup 6
cut 6
da 6
drugs 6
explode 6
fat 6
faux 6
fly 6
g 6
gangsta 6
gave 6
goddamn 6
godzilla 6
gossip 6
hate 6
hip 6
holdin 6
hypnotic 6
ink 6
jah 6
k 6
kill 6
lifetime 6
loose 6
nod 6
ocean 6
papa 6
peace 6
poor 6
pose 6
pow 6
quick 6
rolled 6
screamin 6
sell 6
shelter 6
shows 6
slim 6
song 6
sorry 6
south 6
spit 6
step 6
stunt 6
sun 6
tactics 6
thought 6
throw 6
ugh 6
ultralight 6
v 6
voices 6
wake 6
wiggle 6
word 6
ak 5
alright 5
ask 5
askin 5
aw 5
bottles 5
bouncin 5
box 5
brain 5
breath 5
broke 5
bruce 5
brush 5
business 5
cah 5
cars 5
certified 5
changed 5
children 5
close 5
coming 5
control 5
dad 5
damsel 5
donna 5
dread 5
drink 5
drunk 5
dubs 5
ed 5
faith 5
fake 5
flex 5
foreign 5
gal 5
glass 5
green 5
harder 5
homie 5
ignite 5
kinda 5
later 5
lemme 5
limelight 5
living 5
midwest 5
minute 5
mistake 5
mix 5
motherfuckers 5
murder 5
nice 5
normal 5
pac 5
par 5
pick 5
plastic 5
player 5
pretty 5
promise 5
rain 5
rappers 5
road 5
rock 5
satan 5
seven 5
shady 5
shame 5
sick 5
sippin 5
sky 5
slow 5
songs 5
spot 5
state 5
stripper 5
supposed 5
sweat 5
tomorrow 5
true 5
use 5
vex 5
wayne 5
went 5
women 5
wonder 5
words 5
