new 21594
said 10903
york 10054
year 9235
company 6347
years 6291
city 6264
m 5851
president 5495
lead 5203
today 5092
state 5060
yesterday 4598
million 4583
american 4437
old 4352
time 4026
percent 3798
s 3704
people 3645
home 3529
world 3369
united 3332
national 3146
long 3129
like 3087
street 3037
paid 3035
day 3019
photo 2986
university 2984
states 2972
week 2919
reports 2884
school 2857
business 2814
government 2778
says 2773
january 2740
notice 2722
family 2618
deaths 2612
life 2595
article 2591
john 2569
died 2558
house 2556
federal 2535
public 2296
center 2293
market 2247
officials 2202
high 2198
work 2130
late 2127
war 2127
editor 2119
law 2116
children 2094
college 2068
group 2058
clinton 2057
police 2028
way 2020
father 2012
times 2011
executive 1986
game 1974
international 1935
manhattan 1928
art 1904
court 1856
jersey 1854
man 1845
service 1843
east 1820
ago 1815
news 1812
chief 1788
sunday 1786
services 1779
night 1762
sales 1719
season 1717
mother 1706
country 1688
david 1683
west 1682
team 1654
wife 1654
music 1652
second 1647
washington 1646
letter 1645
director 1639
women 1632
end 1630
stock 1629
month 1614
robert 1614
great 1612
board 1609
billion 1606
health 1604
white 1591
companies 1581
son 1579
good 1563
plan 1551
chairman 1531
department 1529
corporation 1518
television 1515
beloved 1496
program 1493
big 1491
earnings 1488
announced 1473
best 1470
money 1467
office 1463
daughter 1456
america 1443
days 1442
page 1440
months 1426
church 1417
economic 1413
coach 1392
avenue 1386
administration 1383
nation 1377
report 1373
set 1373
place 1366
james 1364
bank 1363
michael 1342
industry 1340
age 1334
little 1333
qtr 1333
book 1325
death 1315
general 1315
husband 1313
called 1308
island 1307
political 1306
major 1300
william 1296
case 1295
left 1286
park 1282
south 1273
help 1270
theater 1260
budget 1259
young 1259
county 1251
right 1245
friday 1243
plans 1241
north 1236
hospital 1235
black 1234
brooklyn 1234
early 1233
football 1232
league 1229
play 1224
based 1200
tax 1197
held 1196
small 1194
history 1192
share 1192
system 1184
use 1183
association 1178
column 1173
george 1173
found 1171
inc 1168
review 1159
december 1152
vice 1151
free 1147
prices 1143
room 1141
medical 1137
expected 1136
record 1135
students 1134
computer 1133
members 1131
fund 1129
financial 1128
building 1126
woman 1123
richard 1121
schools 1117
union 1116
hall 1102
head 1099
men 1097
real 1091
half 1089
mayor 1089
rate 1084
monday 1081
points 1077
tuesday 1077
bush 1066
photos 1061
bill 1060
care 1060
power 1057
weeks 1056
including 1053
recent 1052
economy 1050
congress 1049
agency 1044
deal 1041
open 1040
military 1037
named 1035
education 1033
museum 1031
shares 1030
loving 1026
known 1023
saturday 1012
film 1010
sports 1008
loss 1004
ny 1002
wednesday 1002
point 1000
community 998
thursday 991
number 987
car 986
trade 983
dec 976
foreign 974
co 973
began 968
information 963
took 960
come 958
price 957
far 955
party 955
japan 953
town 952
air 951
member 951
making 946
rose 946
advertising 945
food 943
memorial 939
victory 939
special 938
players 926
pay 925
drug 921
line 920
brother 918
run 917
century 916
came 915
peter 912
judge 905
private 904
road 903
games 902
job 902
fire 901
reviews 899
books 896
basketball 894
close 894
cut 894
friend 889
funeral 886
markets 886
change 883
rates 882
senior 879
devoted 878
largest 874
control 873
oil 873
corrections 870
received 870
charles 869
buy 867
force 864
better 863
san 863
large 859
mark 859
minister 858
paul 854
funds 853
away 852
conference 851
l 851
thomas 851
israel 850
interest 847
past 846
security 846
officer 843
led 842
friends 839
nearly 838
quarter 834
workers 834
trial 833
japanese 830
campaign 829
series 828
taxes 824
council 823
near 822
heart 821
leader 818
offer 813
local 812
look 810
face 808
short 808
lives 807
leaders 805
agreement 804
later 799
net 799
love 798
going 796
decision 795
problems 795
unit 795
boston 794
hours 793
married 793
nations 790
lived 789
jobs 788
committee 787
find 786
policy 786
central 785
iraq 783
know 783
senate 781
insurance 780
republican 780
area 779
notes 779
soviet 778
graduated 777
bond 774
daily 771
tonight 770
contract 765
lost 765
future 764
op 764
support 759
sell 757
official 754
want 754
social 753
chicago 749
firm 749
press 741
won 741
sister 740
california 739
capital 739
nov 739
research 737
performance 736
recently 734
fourth 733
investors 732
need 732
secretary 732
told 732
club 729
investment 728
joseph 727
seven 724
arts 722
europe 722
dance 719
charges 718
reported 718
start 718
talks 718
programs 717
prime 716
estate 715
los 715
works 715
king 714
martin 712
square 712
district 711
society 711
development 710
peace 710
queens 709
meeting 708
technology 706
brown 704
final 704
agreed 703
miss 702
ed 701
angeles 699
cancer 698
americans 697
winter 694
bowl 693
defense 692
hard 691
jan 691
story 689
leading 688
rights 688
human 687
low 686
term 686
issue 685
role 684
crisis 683
aids 682
connecticut 682
cost 680
having 680
stores 676
ended 675
trying 674
growing 672
cases 671
china 671
effort 671
child 668
growth 668
light 661
list 661
bonds 660
post 660
given 659
media 659
stocks 659
telephone 659
space 657
account 656
division 656
retired 654
think 653
played 652
hotel 649
survived 648
dear 646
shot 646
annual 645
attack 645
makes 644
parents 644
according 643
region 642
water 641
increase 640
manager 640
cold 639
restaurant 638
career 635
bills 633
communications 631
charge 630
florida 628
production 628
wall 628
taking 627
despite 626
return 625
closed 624
jewish 624
morning 624
middle 622
begin 621
beach 620
european 620
study 620
taken 619
rise 618
killed 616
fall 615
products 615
personal 614
corp 613
passing 611
russia 611
strong 611
grandmother 610
groups 610
securities 608
staff 607
cause 606
giuliani 606
british 605
living 605
french 604
class 603
changes 600
average 598
lower 598
labor 596
performed 595
project 595
movie 594
russian 593
banks 592
mary 590
de 589
battle 585
planned 585
pm 585
talk 585
different 584
issues 584
professor 583
thousands 583
management 582
sale 582
grandfather 581
went 580
charged 579
army 578
red 578
action 577
minutes 576
round 575
opera 574
smith 574
shows 573
baseball 572
important 572
organization 572
star 572
pres 571
exchange 570
fell 570
hope 569
officers 569
calls 568
working 568
christmas 567
commission 567
november 567
mexico 566
countries 564
got 564
section 564
born 563
course 563
garden 562
corporate 561
france 561
governor 559
lawyer 559
seen 559
things 559
current 558
germany 557
broadway 556
continue 556
miami 556
question 555
poor 554
turn 554
degree 553
magazine 551
store 551
election 550
dollar 549
grandchildren 549
nuclear 549
land 548
live 548
view 548
executives 547
inside 546
problem 546
flowers 545
science 545
trading 545
jones 544
player 544
march 543
turned 543
bronx 542
student 542
let 541
ap 540
tickets 540
evening 538
snow 538
crime 537
london 536
cash 535
dies 535
editorial 535
outside 535
ceremony 534
democratic 534
forces 533
gulf 532
playing 532
spending 532
style 532
sold 531
soon 531
order 530
rules 530
credit 528
income 528
debate 526
frank 526
german 526
likely 526
field 524
justice 524
helped 522
meet 522
efforts 521
employees 521
giants 521
treasury 520
systems 519
bad 518
results 518
latest 516
ii 515
pataki 514
dead 513
housing 513
terms 513
costs 512
level 512
takes 511
owner 510
civil 509
debt 509
green 509
period 509
race 509
vote 509
possible 507
howard 506
served 506
include 505
western 505
coming 504
lot 503
english 502
journal 502
metropolitan 501
contributions 498
radio 497
residents 496
hill 495
stephen 495
asked 494
higher 494
key 494
selling 494
nj 493
running 493
grand 491
bedroom 490
johnson 490
village 489
hand 488
industrial 487
opened 486
operations 486
stage 486
fact 484
title 484
paper 483
travel 483
win 483
england 482
opening 482
rabbi 481
consumer 480
energy 480
knicks 479
network 479
single 479
proposal 478
edward 477
kind 477
madison 477
provide 477
brought 476
decade 476
earlier 476
saying 476
bridge 475
main 475
spokesman 475
tomorrow 475
bath 474
jazz 474
modern 473
common 472
aid 471
cars 471
drawing 471
apartment 470
authority 470
gave 470
teams 470
legal 469
partner 469
raise 469
try 468
june 467
cuts 466
southern 466
weekend 466
data 465
gold 465
looking 465
philadelphia 465
choice 464
master 464
seeking 464
thought 464
daniel 463
beginning 462
republicans 462
supreme 462
francisco 461
elizabeth 460
summer 460
lawyers 458
westchester 458
concern 457
step 457
questions 456
stop 456
hockey 455
offered 455
following 454
result 454
total 454
brothers 453
hold 453
mass 453
commercial 452
created 452
hour 452
memory 452
self 452
killing 451
property 451
spent 451
available 450
hit 449
marketing 449
decades 448
safety 448
analysts 447
earns 447
foundation 447
leave 447
institute 446
beat 445
proposed 445
henry 444
israeli 444
spring 444
murder 443
auto 442
design 442
instead 442
jack 441
longer 441
position 441
artists 440
comes 440
fifth 440
library 440
offers 440
barbara 439
louis 439
investigation 437
previous 437
streets 437
exhibition 436
gallery 436
bring 435
holiday 435
popular 435
remain 435
missed 434
form 433
built 432
interview 432
owners 432
reached 432
welfare 432
getting 431
word 429
index 428
miles 428
worth 428
act 427
rest 427
test 426
blue 425
comments 425
entertainment 425
fight 425
rock 425
tom 425
recession 422
rangers 421
station 421
municipal 420
sign 420
dinkins 419
susan 419
visit 419
accused 418
evidence 418
river 418
success 418
author 417
hills 417
lieu 417
sent 417
columbia 416
eastern 416
decided 414
failed 414
graduate 414
revenue 414
gas 413
gingrich 413
neighborhood 413
winning 413
championship 412
dining 412
seek 412
writer 412
bay 411
experience 411
needed 411
software 410
thing 410
chinese 409
experts 409
read 408
tv 408
video 408
figures 407
probably 407
speaker 407
scored 406
cities 405
fashion 405
cherished 404
teacher 404
disease 403
cemetery 402
effect 402
sense 402
pro 401
afternoon 400
feet 400
met 400
speech 400
mind 399
person 399
clear 398
moved 398
cup 397
newspaper 397
donations 396
goes 396
starting 396
atlantic 395
believe 395
message 395
owned 395
yr 395
events 394
fine 394
wanted 394
giving 392
allow 391
attention 391
create 391
scheduled 391
senator 391
april 390
democrats 390
estimated 390
started 390
dallas 389
especially 389
matter 389
texas 389
plant 388
politics 388
relations 388
standard 387
deep 386
nets 386
signed 386
address 385
families 385
makers 385
words 385
finally 384
reduce 384
ways 384
andrew 383
cuomo 383
practice 383
homes 382
paris 382
brief 381
finance 381
construction 380
included 380
names 380
neediest 380
savings 380
true 380
entire 379
body 378
catholic 378
chronicle 378
failure 378
operating 378
discusses 377
records 377
trip 377
released 376
lewis 375
maker 375
published 375
dow 374
fighting 374
floor 374
fiscal 373
ground 373
needs 373
tour 373
agencies 372
anti 372
artist 372
d 372
passed 372
prison 372
troops 372
appeared 371
assistant 370
bid 370
businesses 370
described 370
begins 369
pop 369
present 369
foot 368
houses 365
weapons 365
digest 364
hollywood 363
worked 363
bob 362
means 362
offering 362
stay 361
able 360
jets 360
kitchen 360
professional 360
van 360
wedding 360
collection 358
map 358
bride 357
drop 357
fear 357
interment 357
majority 357
pressure 357
areas 356
demand 356
e 356
forced 356
sea 356
site 356
cover 355
hundreds 355
lee 355
natural 355
search 355
violence 355
build 354
couple 354
morris 354
remains 354
weather 354
added 353
anthony 353
goal 353
mutual 353
suit 353
cable 352
continued 352
la 352
drive 351
pp 351
ann 350
feel 350
hopes 350
houston 350
ice 350
language 350
ballet 349
cents 349
opposition 349
lines 348
scene 348
value 348
biggest 347
concert 347
girl 347
industries 347
knew 347
planning 347
wide 347
competition 346
movement 346
northern 346
williams 346
stand 345
plus 344
restaurants 344
commissioner 343
environmental 343
chance 342
global 342
loan 342
raised 342
arthur 341
directors 340
dollars 340
focus 340
gets 340
guard 340
dr 339
jackson 339
jim 339
jury 339
rudolph 339
airlines 338
internet 338
wants 338
buildings 337
extend 337
founder 337
moscow 337
ready 337
chapel 335
comment 335
harry 335
metro 335
break 334
stanley 334
teen 333
benefits 332
condolences 332
offices 332
traffic 332
arrested 331
attorney 331
c 331
cross 331
easy 331
guide 331
independent 331
rule 331
ruth 331
sun 330
treas 330
example 329
italian 329
july 329
sound 329
ahead 328
difficult 328
door 328
event 328
asia 327
critics 327
elderly 327
miller 327
picture 327
figure 326
idea 326
increased 326
producer 326
arms 325
bankruptcy 325
computers 325
double 325
forward 325
iraqi 325
millions 325
moving 325
presidential 325
riverside 325
stars 325
filed 324
ford 324
laws 324
partners 324
subway 324
anne 323
detroit 323
playoff 323
storm 323
super 323
bar 322
wrote 322
atlanta 321
equipment 321
finished 321
image 321
lawrence 321
retirement 321
risk 321
sex 321
assets 320
box 320
domestic 320
era 320
gains 320
musical 320
numbers 320
parts 320
patrick 320
process 320
table 320
bought 318
hussein 318
illustrated 318
orange 318
decline 317
inflation 317
kennedy 317
misstated 317
rich 317
walter 317
ave 316
certain 316
mount 316
roman 316
finds 315
quality 315
airport 314
heavy 314
seconds 314
alan 313
baby 313
customers 313
eve 313
kuwait 313
scott 313
devils 312
acquire 311
dinner 311
drugs 311
fast 311
fiction 311
gone 311
sharply 311
criminal 310
plays 310
powerful 310
significant 310
usually 310
al 309
appears 309
cultural 309
generation 309
gives 309
minute 309
subject 309
voice 309
written 309
broker 308
dispute 308
donald 308
georgia 308
heard 308
joe 308
letters 308
listed 308
saw 308
hands 307
homeless 307
intended 307
visiting 307
britain 306
challenge 306
injured 306
lincoln 306
october 306
reading 306
stake 306
worst 306
bosnia 305
claims 305
korea 305
nyc 305
phone 305
princeton 305
shopping 305
train 305
closing 304
faces 304
retail 304
note 303
persian 303
reserve 303
stories 303
block 302
elected 302
j 302
potential 302
receive 302
regional 302
representative 302
christopher 300
leaving 300
quickly 300
wrong 300
defeat 299
hot 299
loved 299
moment 299
settlement 299
greenwich 298
mail 298
pittsburgh 298
tell 298
apparently 297
ask 297
canada 297
doctors 297
tried 297
accounts 296
involved 296
nee 296
trust 296
b 295
benefit 295
steve 295
suspect 295
coast 294
correction 294
noon 294
champion 293
jane 293
urban 293
bus 292
buying 292
panel 292
warner 292
patients 291
produced 291
reform 291
steps 291
appear 290
elections 290
fame 290
includes 290
jean 290
secret 290
sure 290
valley 290
bruce 289
fans 289
heights 289
novel 289
pages 289
changed 288
eye 288
losing 288
upper 288
increasingly 287
mexican 287
negotiations 287
noted 287
pacific 287
performances 287
save 287
training 287
looks 286
reach 286
reason 286
track 286
admission 285
african 285
attempt 285
award 285
harvard 285
protection 285
raising 285
response 285
returned 285
fresh 284
herbert 284
straight 284
strike 284
cast 283
paintings 283
particularly 283
st 283
allen 282
boy 282
considered 282
eat 282
gain 282
studies 282
range 281
electronic 280
gay 280
highest 280
largely 280
leadership 280
newark 280
outlook 280
statement 280
yorkers 280
deeply 279
greater 279
signs 279
similar 279
threat 279
version 279
deficit 278
ordered 278
related 278
express 277
legislature 277
original 277
seat 277
appointed 276
communist 276
ending 276
followed 276
jeffrey 276
medicine 276
republic 276
standards 276
tough 276
hear 275
product 275
shooting 275
surgery 275
designed 274
dropped 274
glass 274
mike 274
nancy 274
ruling 274
flight 273
holding 273
rising 273
calling 272
congressional 272
scientists 272
transportation 272
treatment 272
virginia 272
campbell 271
continuing 271
showed 271
yield 271
caused 270
familiar 270
huge 270
ends 269
issued 269
lake 269
parties 269
silver 269
bit 268
christian 268
holds 268
nature 268
regular 268
spend 268
associate 267
dark 267
expect 267
mourn 267
send 267
tournament 267
campus 266
leaves 266
philip 266
apple 265
consumers 265
currency 265
golf 265
card 264
complete 264
culture 264
forest 264
agent 263
hudson 263
islanders 263
prevent 263
ball 262
complex 262
cutting 262
discussed 262
illness 262
indian 262
jordan 262
begun 261
candidate 261
helen 261
lawsuit 261
lose 261
margaret 261
sons 261
steven 261
teachers 261
abortion 260
africa 260
ban 260
chain 260
hearing 260
whitman 260
affairs 259
approach 259
approved 259
avoid 259
continues 259
electric 259
pass 259
sought 259
wo 259
losses 258
presented 258
talking 258
units 258
watch 258
approval 257
associated 257
conservative 257
schedule 257
writing 257
banking 256
population 256
previously 256
victims 256
alexander 255
associates 255
audience 255
cbs 255
movies 255
resigned 255
simple 255
anderson 254
setting 254
spirit 254
blizzard 253
serve 253
stadium 253
date 252
finding 252
happy 252
managers 252
runs 252
sexual 252
subsidiary 252
denver 251
eric 251
neck 251
purchase 251
soldiers 251
actually 250
add 250
keeping 250
piece 250
sets 250
singer 250
active 249
filled 249
giant 249
guilty 249
allowed 248
joined 248
maybe 248
appeal 247
democracy 247
disclosed 247
goals 247
headed 247
jonathan 247
promised 247
stone 247
walk 247
increasing 246
latin 246
wine 246
academy 245
developed 245
eyes 245
gun 245
kept 245
longtime 245
seeks 245
yale 245
assembly 244
projects 244
release 244
simon 244
barry 243
dozen 243
felt 243
places 243
shop 243
waiting 243
acquired 242
baker 242
consider 242
douglas 242
remember 242
suddenly 242
championships 241
downtown 241
ill 241
loans 241
measure 241
microsoft 241
orchestra 241
rebels 241
summary 241
worldwide 241
answer 240
profits 240
prosecutors 240
provided 240
required 240
saddam 240
source 240
successful 240
agree 239
cards 239
carolina 239
defensive 239
freedom 239
helping 239
jerry 239
outst 239
plants 239
religious 239
tech 239
turning 239
asian 238
bell 238
centers 238
clean 238
direct 238
driving 238
el 238
improve 238
olympic 238
resident 238
august 237
balance 237
benjamin 237
contends 237
favorite 237
host 237
managed 237
mean 237
port 237
songs 237
traditional 237
actor 236
damage 236
dismissed 236
emergency 236
engagement 236
headquarters 236
older 236
tiny 236
base 235
color 235
dean 235
deputy 235
dream 235
join 235
relationship 235
wild 235
bureau 234
completed 234
films 234
follow 234
organizations 234
plains 234
publisher 234
returns 234
warm 234
concerns 233
fat 233
intelligence 233
match 233
northeast 233
notebook 233
suffered 233
troubled 233
venture 233
access 232
awards 232
established 232
fish 232
massachusetts 232
rare 232
sympathy 232
temple 232
transit 232
cowboys 231
introduced 231
kevin 231
looked 231
newt 231
operation 231
profit 231
survey 231
windows 231
additional 230
cohen 230
die 230
italy 230
policies 230
relief 230
simply 230
vision 230
wins 230
writers 230
briefs 229
broad 229
davis 229
earth 229
handle 229
manufacturing 229
model 229
resolution 229
september 229
tests 229
wood 229
blood 228
chart 228
mario 228
memories 228
nbc 228
photographs 228
prepared 228
quarterback 228
seasons 228
harold 227
historic 227
legislation 227
session 227
abuse 226
aunt 226
candidates 226
creative 226
garage 226
goods 226
increases 226
mission 226
ohio 226
palestinian 226
showing 226
speed 226
weekly 226
addition 225
arrived 225
carol 225
ex 225
forever 225
illegal 225
images 225
joan 225
yeltsin 225
criticism 224
fox 224
limited 224
opportunity 224
thinking 224
amsterdam 223
harlem 223
highly 223
protect 223
suggests 223
coaches 222
discount 222
knows 222
learned 222
properties 222
status 222
strength 222
adored 221
bernard 221
chemical 221
commerce 221
digital 221
w 221
australia 220
coalition 220
critical 220
hotels 220
individual 220
lack 220
mixed 220
performing 220
slow 220
t 220
variety 220
voted 220
winner 220
amid 219
authorities 219
boys 219
fair 219
february 219
promise 219
saudi 219
serving 219
band 218
beth 218
coffee 218
crowd 218
grace 218
happened 218
involving 218
orders 218
trouble 218
unusual 218
basic 217
broke 217
buffalo 217
counsel 217
deadline 217
details 217
doctor 217
elect 217
facing 217
nato 217
racing 217
tradition 217
agents 216
appeals 216
develop 216
placed 216
size 216
steel 216
suggested 216
surprise 216
athletic 215
irish 215
protest 215
canadian 214
directed 214
educational 214
founded 214
impeachment 214
maintenance 214
memorials 214
publishing 214
strategy 214
youth 214
analysis 213
billings 213
corner 213
critic 213
investigators 213
larger 213
minority 213
moore 213
parent 213
pictures 213
plaza 213
sam 213
tennis 213
votes 213
advanced 212
declared 212
falls 212
hong 212
owns 212
todd 212
armed 211
assault 211
dennis 211
disney 211
honor 211
larry 211
moves 211
pieces 211
profile 211
ronald 211
stopped 211
turns 211
vincent 211
border 210
chamber 210
gov 210
principal 210
sees 210
yankees 210
abc 209
birth 209
contemporary 209
hartford 209
networks 209
opens 209
samuel 209
tells 209
widely 209
advice 208
bear 208
commitment 208
declined 208
electronics 208
harris 208
ideas 208
pace 208
plane 208
reporters 208
ones 207
quick 207
reasons 207
replace 207
twice 207
farm 206
grew 206
kong 206
pennsylvania 206
ran 206
responsible 206
santa 206
sides 206
accord 205
airline 205
arena 205
claim 205
composer 205
determined 205
heartfelt 205
playoffs 205
scores 205
tree 205
acting 204
blues 204
condition 204
missing 204
convention 203
female 203
financing 203
india 203
merger 203
nassau 203
produce 203
safe 203
write 203
bosnian 202
celebration 202
driver 202
headline 202
tie 202
tokyo 202
covered 201
democrat 201
distance 201
harbor 201
levels 201
machine 201
route 201
attacks 200
brian 200
hurt 200
impact 200
joint 200
norman 200
shift 200
basis 199
display 199
doubt 199
heads 199
iran 199
learning 199
perform 199
prominent 199
remembered 199
require 199
basement 198
believed 198
carry 198
famous 198
package 198
painting 198
piano 198
remaining 198
towns 198
character 197
crown 197
economists 197
error 197
offensive 197
palm 197
proposals 197
shown 197
streak 197
vietnam 197
designer 196
h 196
minnesota 196
morgan 196
native 196
non 196
trees 196
anniversary 195
citizens 195
convicted 195
discuss 195
expensive 195
fl 195
gift 195
kelly 195
parliament 195
r 195
recovery 195
rent 195
tobacco 195
vehicles 195
victim 195
gary 194
jerusalem 194
kill 194
lane 194
learn 194
mental 194
politicians 194
rating 194
resources 194
struggle 194
trustees 194
wait 194
abroad 193
agrees 193
classical 193
equity 193
hospitals 193
machines 193
racial 193
unemployment 193
amy 192
concerned 192
confidence 192
decide 192
ethnic 192
god 192
kenneth 192
rain 192
uncle 192
yes 192
advance 191
dan 191
episcopal 191
fears 191
graph 191
manufacturers 191
parking 191
separate 191
sorrow 191
suspended 191
announcement 190
birthday 190
broadcast 190
changing 190
internal 190
meetings 190
progress 190
provides 190
sleep 190
slightly 190
acquisition 189
carried 189
christine 189
cleveland 189
consultant 189
discovered 189
francis 189
immediately 189
prosecutor 189
raises 189
roger 189
rush 189
stations 189
stern 189
ad 188
baltimore 188
ben 188
burial 188
classic 188
consecutive 188
coordinator 188
horse 188
irving 188
preparing 188
rejected 188
haven 187
institutions 187
jay 187
judith 187
mo 187
nationwide 187
newspapers 187
spot 187
albany 186
colleagues 186
diego 186
ethics 186
festival 186
foster 186
residential 186
truck 186
conditions 185
cuba 185
edge 185
expansion 185
expectations 185
minor 185
motor 185
packers 185
pain 185
remained 185
teaching 185
aimed 184
fraud 184
lisa 184
necessary 184
prize 184
random 184
score 184
screen 184
sites 184
transactions 184
tribute 184
auction 183
caught 183
dealers 183
effective 183
grow 183
historical 183
junior 183
kansas 183
measures 183
royal 183
scandal 183
situation 183
unions 183
wonder 183
awarded 182
collapse 182
contracts 182
disputes 182
matthew 182
mile 182
navy 182
primary 182
sort 182
tony 182
antonio 181
inquiry 181
poland 181
song 181
speak 181
travelers 181
ability 180
ct 180
deepest 180
linda 180
officiated 180
paying 180
pentagon 180
perfect 180
push 180
puts 180
quiet 180
refused 180
virtually 180
wilson 180
ancient 179
deals 179
dreams 179
enter 179
extended 179
extra 179
faced 179
hearts 179
immigrants 179
jr 179
mortgage 179
putting 179
reporter 179
rival 179
albert 178
fewer 178
identified 178
korean 178
newly 178
particular 178
pianist 178
rooms 178
symphony 178
wonderful 178
boat 177
buyers 177
conducted 177
considering 177
don 177
draft 177
fees 177
harvey 177
humor 177
nicholas 177
physical 177
presidents 177
regulators 177
researchers 177
rev 177
starts 177
threatened 177
accident 176
activity 176
compared 176
enforcement 176
excerpts 176
factory 176
noriega 176
ross 176
row 176
spanish 176
speaking 176
sport 176
ties 176
voters 176
arab 175
carter 175
charlotte 175
crucial 175
delay 175
describes 175
employment 175
leonard 175
nasdaq 175
patricia 175
supply 175
veteran 175
channel 174
crash 174
crimes 174
dangerous 174
drama 174
earned 174
holdings 174
jail 174
janet 174
managing 174
recommended 174
reduced 174
salomon 174
stands 174
studio 174
bitter 173
carrying 173
clearly 173
daughters 173
items 173
limit 173
listing 173
magic 173
marriage 173
split 173
walls 173
activities 172
adding 172
arrest 172
formed 172
gilman 172
joyce 172
lowest 172
promises 172
replaced 172
structure 172
visitors 172
aides 171
chancellor 171
copies 171
creating 171
criticized 171
guy 171
muslim 171
watching 171
animals 170
bomb 170
coverage 170
environment 170
heat 170
male 170
nearby 170
prince 170
respect 170
ruled 170
saturdays 170
tables 170
warned 170
broken 169
chris 169
cum 169
denied 169
effects 169
hair 169
misidentified 169
pound 169
aide 168
bears 168
breast 168
certainly 168
chapter 168
communities 168
controlled 168
draw 168
girls 168
hero 168
milton 168
mountain 168
referred 168
seeded 168
senators 168
spread 168
understand 168
accept 167
acre 167
buyer 167
causes 167
charity 167
courts 167
dedicated 167
diplomats 167
fun 167
jennifer 167
material 167
palestinians 167
presence 167
pulled 167
reflect 167
revolution 167
ride 167
sarah 167
seats 167
selected 167
sept 167
sundays 167
syracuse 167
usual 167
alice 166
australian 166
blacks 166
clinic 166
euro 166
featuring 166
forms 166
golden 166
institution 166
interior 166
lady 166
limits 166
max 166
modest 166
rally 166
ralph 166
representatives 166
sat 166
stood 166
struggling 166
berman 165
carl 165
defeated 165
represent 165
request 165
actress 164
advisers 164
camp 164
corruption 164
difference 164
grown 164
holy 164
initial 164
inspired 164
michigan 164
pact 164
peru 164
pick 164
sugar 164
urges 164
volume 164
weak 164
announce 163
colleague 163
ellen 163
gray 163
inaugural 163
jews 163
leads 163
leon 163
rescue 163
residence 163
soul 163
species 163
clothing 162
colonial 162
debut 162
farmers 162
fatal 162
forget 162
influence 162
interests 162
laude 162
ray 162
smaller 162
struck 162
supposed 162
violent 162
alternative 161
aside 161
chase 161
dave 161
dick 161
inches 161
incorrectly 161
jet 161
monthly 161
nonfiction 161
outstanding 161
prospect 161
reality 161
resignation 161
resort 161
saatchi 161
sells 161
shared 161
soft 161
suffering 161
vast 161
window 161
arm 160
cabinet 160
colleges 160
conflict 160
engineering 160
fare 160
finish 160
luxury 160
meant 160
n 160
nursing 160
partnership 160
powers 160
retailers 160
shareholders 160
theme 160
worse 160
advantage 159
bright 159
broncos 159
crew 159
feeling 159
islamic 159
karen 159
patient 159
raymond 159
removed 159
returning 159
suburban 159
type 159
wind 159
ages 158
analyst 158
architecture 158
beautiful 158
determine 158
drawings 158
fellow 158
fred 158
jeff 158
jerome 158
payments 158
producers 158
somalia 158
taste 158
tennessee 158
testing 158
arizona 157
bernstein 157
brings 157
charter 157
colorado 157
dorothy 157
eventually 157
gifts 157
guns 157
hardly 157
li 157
musicians 157
seventh 157
sitting 157
suggest 157
taylor 157
wake 157
web 157
wish 157
witnesses 157
acres 156
ambassador 156
casino 156
choices 156
expects 156
fill 156
flights 156
generally 156
haiti 156
legislative 156
takeover 156
wear 156
wing 156
alliance 155
articles 155
catherine 155
committed 155
conduct 155
empire 155
flying 155
literary 155
luther 155
ma 155
mystery 155
oct 155
sounds 155
wearing 155
welcome 155
aircraft 154
beating 154
boris 154
cornell 154
engine 154
furniture 154
highway 154
minimum 154
otc 154
sixth 154
standing 154
technologies 154
trend 154
warren 154
willing 154
worker 154
academic 153
bombing 153
combined 153
duty 153
failing 153
manufacturer 153
neighbors 153
parks 153
prospects 153
pushed 153
rises 153
sentence 153
spoke 153
arabia 152
brain 152
clark 152
diplomatic 152
expert 152
faculty 152
falling 152
liberal 152
pan 152
permanent 152
scale 152
stamford 152
ticket 152
traded 152
witness 152
adams 151
boulevard 151
dolphins 151
emerged 151
grant 151
responsibility 151
ski 151
spain 151
accepted 150
celebrated 150
coleman 150
districts 150
expand 150
lay 150
leslie 150
macy 150
mitchell 150
redskins 150
ron 150
sisters 150
steelers 150
swiss 150
tale 150
ads 149
architect 149
bridegroom 149
bringing 149
continental 149
federation 149
fields 149
files 149
hired 149
lesson 149
lift 149
literature 149
matters 149
passengers 149
promoted 149
robinson 149
salary 149
ship 149
suicide 149
taught 149
tied 149
toll 149
urged 149
waste 149
wave 149
yards 149
abandoned 148
advocates 148
asking 148
attend 148
cd 148
circle 148
depression 148
duke 148
gardens 148
grade 148
investments 148
options 148
recorded 148
spokeswoman 148
utility 148
warning 148
agenda 147
alfred 147
beauty 147
brazil 147
crude 147
dog 147
essay 147
f 147
firms 147
kids 147
plastic 147
rail 147
relatively 147
statistics 147
barely 146
chicken 146
core 146
ease 146
entered 146
exhibit 146
fed 146
goldstein 146
midnight 146
motors 146
ocean 146
panama 146
presbyterian 146
providing 146
readers 146
ring 146
chosen 145
collegiate 145
hoping 145
injuries 145
k 145
queen 145
ryan 145
sanctions 145
shape 145
soho 145
testimony 145
truth 145
actions 144
allows 144
baghdad 144
comedy 144
creation 144
drew 144
favor 144
folk 144
injury 144
lynn 144
nephews 144
nieces 144
priced 144
resume 144
severe 144
shore 144
target 144
task 144
terry 144
unlikely 144
views 144
brand 143
constitution 143
cuban 143
degrees 143
dramatic 143
drink 143
fired 143
frederick 143
hits 143
indonesia 143
marks 143
mourns 143
pre 143
proud 143
solution 143
switzerland 143
theodore 143
trail 143
apart 142
brokers 142
closer 142
developer 142
fallen 142
foods 142
governments 142
overall 142
skating 142
smoke 142
thompson 142
uses 142
briefing 141
clubs 141
extraordinary 141
greatest 141
immediate 141
legacy 141
prepare 141
ratings 141
reagan 141
adults 140
borough 140
check 140
clothes 140
explain 140
features 140
flat 140
hispanic 140
independence 140
priest 140
revenues 140
sharp 140
smoking 140
ukraine 140
younger 140
berlin 139
breaking 139
chair 139
cincinnati 139
dame 139
desert 139
exactly 139
gained 139
gene 139
happen 139
inspiration 139
levy 139
lights 139
link 139
overseas 139
penn 139
shots 139
studying 139
toronto 139
wounded 139
wright 139
adviser 138
arkansas 138
athletes 138
boeing 138
dole 138
easier 138
incident 138
metal 138
occupied 138
path 138
profound 138
roy 138
seattle 138
sentenced 138
touch 138
treaty 138
agers 137
ceiling 137
choose 137
compete 137
complications 137
constitutional 137
establish 137
hebron 137
jose 137
lawmakers 137
magazines 137
ranked 137
realty 137
regulations 137
soup 137
titles 137
unlike 137
accounting 136
announces 136
boom 136
childhood 136
count 136
disaster 136
greek 136
immigration 136
landscape 136
maintain 136
ordinary 136
paramount 136
penalty 136
percentage 136
rice 136
roosevelt 136
shut 136
survive 136
sylvia 136
telecommunications 136
thanks 136
voting 136
yen 136
zone 136
anna 135
appointment 135
bird 135
broadcasting 135
bulls 135
clients 135
conventional 135
eating 135
improvement 135
ireland 135
lunch 135
lynch 135
pool 135
remove 135
repair 135
shops 135
skills 135
summit 135
turmoil 135
unable 135
vehicle 135
anger 134
cited 134
cook 134
diary 134
eagles 134
eighth 134
expanded 134
g 134
occurred 134
pocket 134
positions 134
salt 134
supplies 134
surface 134
temporary 134
alive 133
causing 133
dozens 133
economics 133
emerging 133
graham 133
knee 133
legislators 133
marc 133
marie 133
organized 133
pete 133
philharmonic 133
phillips 133
reflects 133
surge 133
technical 133
virus 133
currently 132
documents 132
florence 132
fly 132
fort 132
fuel 132
mid 132
orthodox 132
pat 132
positive 132
pounds 132
reaction 132
rural 132
succeed 132
supporters 132
apparent 131
biography 131
carnegie 131
friedman 131
jacob 131
neil 131
practices 131
scientific 131
sponsored 131
stuart 131
x 131
admitted 130
adopted 130
apartments 130
appearance 130
asks 130
automobile 130
device 130
dividend 130
drawn 130
economist 130
engineer 130
file 130
gap 130
heavily 130
interested 130
louise 130
marked 130
mention 130
o 130
roll 130
rye 130
schwartz 130
alcohol 129
brick 129
danger 129
decisions 129
employee 129
generous 129
illinois 129
indiana 129
kim 129
oklahoma 129
puerto 129
remarkable 129
requires 129
signal 129
southeast 129
telerate 129
trucks 129
universities 129
advisory 128
ambitious 128
beijing 128
busy 128
combat 128
cooking 128
corporations 128
dawn 128
developing 128
disabled 128
imposed 128
marilyn 128
nebraska 128
neighborhoods 128
nonprofit 128
oilers 128
opponents 128
orleans 128
pitcher 128
possibly 128
pull 128
reportedly 128
staten 128
supported 128
thin 128
trains 128
winners 128
adam 127
allies 127
chrysler 127
competitive 127
delivery 127
demands 127
driven 127
equal 127
florio 127
invited 127
klein 127
opinion 127
opposed 127
palace 127
poetry 127
settle 127
sit 127
sources 127
yard 127
allowing 126
backed 126
bed 126
chip 126
consulting 126
direction 126
distinguished 126
elegant 126
existing 126
fleet 126
pension 126
possibility 126
prudential 126
reputation 126
russians 126
victor 126
vintage 126
chess 125
emotional 125
entry 125
focused 125
goldman 125
hole 125
pretty 125
proposes 125
skiing 125
stewart 125
brokerage 124
dealer 124
delayed 124
describe 124
diamond 124
esteemed 124
faith 124
hamilton 124
historian 124
holocaust 124
jimmy 124
lloyd 124
meaning 124
notre 124
physician 124
protests 124
represents 124
ridge 124
satellite 124
sending 124
serbian 124
shelter 124
traders 124
behavior 123
billy 123
citing 123
discussion 123
divided 123
greatly 123
improved 123
laura 123
liberty 123
nelson 123
normal 123
pollution 123
prove 123
receiving 123
religion 123
robin 123
seriously 123
statements 123
animal 122
audiences 122
bag 122
canceled 122
caring 122
counter 122
diane 122
disk 122
forcing 122
holland 122
ira 122
killings 122
merrill 122
motion 122
opportunities 122
publication 122
relatives 122
silicon 122
upset 122
walt 122
courses 121
directly 121
discrimination 121
emeritus 121
engaged 121
fate 121
geneva 121
gerald 121
glen 121
identity 121
inch 121
moral 121
offense 121
oh 121
overtime 121
rental 121
rogers 121
rosen 121
scholar 121
sidney 121
trump 121
wars 121
wisdom 121
bankers 120
battered 120
bigger 120
calendar 120
cathedral 120
characters 120
circuit 120
complaints 120
egypt 120
harper 120
helps 120
inner 120
kings 120
oliver 120
painter 120
petroleum 120
pilot 120
proved 120
schuster 120
seeing 120
somewhat 120
stepped 120
argument 119
artistic 119
betty 119
cooper 119
defeats 119
designs 119
doors 119
expanding 119
focuses 119
gordon 119
governors 119
handling 119
indicates 119
joshua 119
journalists 119
joy 119
layoffs 119
lessons 119
location 119
parker 119
print 119
recording 119
sara 119
selection 119
understanding 119
viking 119
walking 119
actors 118
album 118
cafe 118
cap 118
capitol 118
comeback 118
designers 118
fireplace 118
gasoline 118
guests 118
inauguration 118
investigating 118
mentally 118
museums 118
obvious 118
premiere 118
presents 118
providence 118
ranking 118
rarely 118
roof 118
roots 118
sarajevo 118
sue 118
theory 118
timothy 118
treat 118
trends 118
vernon 118
widow 118
allan 117
blocks 117
comfort 117
commander 117
dancing 117
dealing 117
earn 117
estimates 117
gates 117
grows 117
guerrillas 117
laid 117
landmark 117
lebanon 117
olympics 117
parcells 117
plot 117
presidency 117
ranch 117
representing 117
resolve 117
roles 117
shock 117
strip 117
sweet 117
taxpayers 117
amendment 116
delivered 116
dying 116
fails 116
gorbachev 116
heating 116
holidays 116
imports 116
lists 116
martha 116
meets 116
menu 116
numerous 116
promote 116
remarks 116
seton 116
surprising 116
telling 116
theaters 116
walked 116
wayne 116
celebrate 115
cool 115
divorce 115
economies 115
georgetown 115
insure 115
jump 115
linked 115
manuel 115
partial 115
patent 115
rapidly 115
searching 115
singing 115
suffolk 115
tape 115
veterans 115
woods 115
yonkers 115
alabama 114
arnold 114
attacked 114
bias 114
breakfast 114
captain 114
civilian 114
classes 114
developers 114
dress 114
editing 114
elementary 114
fee 114
fishing 114
jon 114
prospective 114
recalled 114
rutgers 114
talent 114
therapy 114
weight 114
attended 113
bass 113
boycott 113
caribbean 113
cartoon 113
cells 113
celtics 113
companion 113
correct 113
deborah 113
deliver 113
devices 113
editors 113
franklin 113
gang 113
journalist 113
journey 113
maria 113
missiles 113
monica 113
p 113
races 113
rape 113
reaching 113
reducing 113
renewed 113
roads 113
subjects 113
threatening 113
tons 113
trustee 113
widespread 113
affected 112
angry 112
answers 112
apply 112
appreciated 112
bantam 112
catch 112
chef 112
corps 112
distribution 112
easily 112
fridays 112
helmsley 112
knopf 112
loeb 112
materials 112
nights 112
pair 112
patriots 112
primarily 112
pushing 112
republics 112
retailer 112
rockefeller 112
seized 112
sweeping 112
abraham 111
bread 111
cease 111
concluded 111
edited 111
feature 111
indians 111
keeps 111
maine 111
mix 111
operator 111
orlando 111
papers 111
poet 111
poverty 111
programming 111
pursue 111
rebel 111
reception 111
retire 111
russell 111
simpson 111
sky 111
specific 111
voices 111
blame 110
combination 110
evelyn 110
founding 110
gilbert 110
hoped 110
imagine 110
lions 110
marine 110
northwest 110
ownership 110
purpose 110
repertory 110
risks 110
settled 110
thoughts 110
tower 110
traveling 110
ultimate 110
billions 109
clinics 109
colors 109
concept 109
controls 109
ensemble 109
formally 109
goldberg 109
handled 109
jacksonville 109
jesse 109
ken 109
meat 109
murray 109
nice 109
performers 109
promising 109
q 109
revival 109
strongly 109
tales 109
text 109
tourist 109
tries 109
triumph 109
universe 109
visits 109
airports 108
challenges 108
command 108
enterprises 108
essex 108
ewing 108
forum 108
fully 108
fundamental 108
granted 108
keating 108
knowledge 108
marshall 108
objects 108
officially 108
partly 108
passage 108
passenger 108
propose 108
railroad 108
specialty 108
speculation 108
territory 108
tuesdays 108
watched 108
yugoslavia 108
banker 107
bound 107
butler 107
clinical 107
connection 107
gambling 107
grants 107
hearings 107
hire 107
intense 107
investing 107
lehman 107
moments 107
planes 107
plenty 107
pope 107
restore 107
rita 107
shortly 107
spots 107
striking 107
sudden 107
surplus 107
tensions 107
transition 107
affect 106
composers 106
defend 106
diana 106
discussions 106
exports 106
gathered 106
hampton 106
herman 106
milwaukee 106
participants 106
passion 106
preliminary 106
refugees 106
scholarship 106
sector 106
solo 106
sony 106
strikes 106
suzanne 106
tone 106
touched 106
turkey 106
unexpected 106
whitney 106
dances 105
eager 105
eliminate 105
experienced 105
expressed 105
formal 105
halt 105
hunt 105
investor 105
jason 105
joining 105
judges 105
milk 105
option 105
oxford 105
photography 105
prisoners 105
publicly 105
quotation 105
reduction 105
restrictions 105
rico 105
sandra 105
substantial 105
surprised 105
taiwan 105
wise 105
yields 105
aggressive 104
appropriate 104
assisted 104
ballantine 104
champions 104
coaching 104
code 104
delays 104
exercise 104
frozen 104
genetic 104
healthy 104
hip 104
le 104
lease 104
medal 104
ministry 104
montana 104
narrow 104
operates 104
picked 104
shutdown 104
stolen 104
teach 104
tourists 104
transfer 104
aaron 103
aged 103
assn 103
balanchine 103
bedford 103
chelsea 103
chiefs 103
civic 103
concerts 103
demanding 103
differences 103
dominated 103
facts 103
joel 103
lawsuits 103
medicare 103
models 103
originally 103
patterns 103
peacekeeping 103
photographer 103
phyllis 103
politically 103
popularity 103
psychiatrist 103
replacing 103
serbs 103
strategic 103
sullivan 103
upheaval 103
worry 103
administrative 102
advocate 102
centre 102
collapsed 102
conspiracy 102
craig 102
dishes 102
dutch 102
electrical 102
enormous 102
eugene 102
fit 102
horror 102
indicted 102
intel 102
lots 102
manage 102
murphy 102
newest 102
peacefully 102
publishers 102
renaissance 102
rivals 102
scenes 102
serves 102
starring 102
stroke 102
symbol 102
terminal 102
truly 102
values 102
adoring 101
bench 101
bennett 101
breaks 101
cousin 101
dancers 101
deadly 101
doris 101
flu 101
fought 101
fruit 101
garbage 101
iowa 101
julia 101
label 101
mood 101
nixon 101
palmer 101
prosecution 101
sculpture 101
ted 101
volunteers 101
affair 100
buys 100
chose 100
closely 100
contest 100
diet 100
elaine 100
feels 100
fisher 100
follows 100
harassment 100
hillary 100
minds 100
overhaul 100
permit 100
personnel 100
phoenix 100
pledge 100
portland 100
preserve 100
quarters 100
ranging 100
recalls 100
rookie 100
ships 100
sight 100
singers 100
sworn 100
tampa 100
waters 100
austria 99
branch 99
brunswick 99
caption 99
client 99
crowded 99
dept 99
doubts 99
enjoyed 99
fairfield 99
flow 99
fortune 99
generosity 99
introduce 99
judy 99
laboratory 99
merely 99
netanyahu 99
operated 99
opposite 99
painted 99
pride 99
radical 99
reporting 99
retiring 99
rochelle 99
semiconductor 99
slump 99
stuff 99
survival 99
swept 99
tenants 99
topics 99
utilities 99
winds 99
adult 98
assistance 98
behalf 98
checks 98
competing 98
costly 98
editorials 98
export 98
faster 98
greene 98
gregory 98
interesting 98
interviews 98
leo 98
mayer 98
medium 98
moderate 98
payment 98
releases 98
represented 98
respond 98
sally 98
silence 98
slowly 98
sued 98
sweden 98
thick 98
tired 98
vital 98
warns 98
writes 98
arguments 97
attached 97
burke 97
cambridge 97
doubleday 97
handed 97
impossible 97
indicated 97
lobby 97
lord 97
memoir 97
monetary 97
mountains 97
optimism 97
psychiatric 97
rebounds 97
reference 97
requiring 97
resolutions 97
saved 97
sellers 97
seymour 97
strange 97
vallone 97
wagner 97
ward 97
achieve 96
acts 96
approve 96
bobby 96
climate 96
collins 96
colombia 96
currencies 96
deposit 96
drinking 96
enjoy 96
gathering 96
inmates 96
jumped 96
levine 96
medicaid 96
meyer 96
poll 96
producing 96
repeatedly 96
salvador 96
sinai 96
soccer 96
suits 96
supermarket 96
transaction 96
treated 96
trials 96
types 96
weiss 96
withdrawal 96
zion 96
acknowledged 95
beneath 95
bishop 95
bookstores 95
brilliant 95
cape 95
cat 95
cites 95
conductor 95
confirmed 95
conn 95
defendants 95
departure 95
edition 95
eligible 95
exception 95
financed 95
futures 95
las 95
myers 95
outlets 95
pregnant 95
professionals 95
regarded 95
shoulder 95
specialist 95
sponsor 95
sydney 95
tight 95
tracks 95
volunteer 95
walker 95
wendy 95
argue 94
array 94
balanced 94
bradley 94
camera 94
chapels 94
confusion 94
contributed 94
dancer 94
elite 94
factors 94
happens 94
harrison 94
helicopter 94
hiring 94
jaguars 94
kathleen 94
mall 94
membership 94
moody 94
pierre 94
pledged 94
portrait 94
scarsdale 94
sciences 94
suffer 94
transformed 94
usa 94
vacation 94
viewers 94
withdraw 94
aboard 93
allied 93
aviation 93
blind 93
bombs 93
burns 93
careers 93
cod 93
crack 93
dogs 93
drops 93
editions 93
emily 93
extends 93
fail 93
forecast 93
frances 93
ft 93
harder 93
hidden 93
insisted 93
iron 93
license 93
midtown 93
moon 93
offerings 93
passes 93
potentially 93
privately 93
reservations 93
roberts 93
tim 93
vatican 93
adds 92
ailing 92
bars 92
blocked 92
boutros 92
circumstances 92
claimed 92
croatia 92
desire 92
drivers 92
electricity 92
false 92
funny 92
galleries 92
killer 92
lillian 92
meter 92
normally 92
oldest 92
painful 92
portion 92
quoted 92
recognition 92
regulatory 92
resign 92
rolling 92
shuttle 92
stretch 92
stronger 92
talked 92
users 92
vacant 92
valued 92
alex 91
attributed 91
beaten 91
blow 91
brooks 91
cambodia 91
cleared 91
concessions 91
congregation 91
conversation 91
elements 91
equally 91
escape 91
honored 91
hunter 91
intellectual 91
israelis 91
keith 91
lyrics 91
min 91
montclair 91
mothers 91
noteworthy 91
peso 91
philosophy 91
quietly 91
recognize 91
rick 91
rouge 91
sad 91
schneider 91
shadow 91
sir 91
smart 91
surely 91
underground 91
undisclosed 91
vegas 91
wells 91
y 91
allegations 90
beer 90
birds 90
buses 90
chaos 90
chargers 90
charts 90
christ 90
controversy 90
defendant 90
diplomat 90
elliott 90
engineers 90
excellent 90
goodman 90
hate 90
hoffman 90
hungary 90
identify 90
improving 90
kentucky 90
mci 90
montreal 90
optimistic 90
pioneer 90
plea 90
practical 90
rapid 90
rhode 90
sadness 90
safire 90
shoes 90
survivors 90
threats 90
tours 90
treasurer 90
typical 90
weicker 90
afford 89
angels 89
burden 89
burning 89
edith 89
effectively 89
entirely 89
everybody 89
flood 89
graphics 89
jefferson 89
mainly 89
mcdonald 89
predicted 89
punishment 89
rams 89
rank 89
richardson 89
spoken 89
supermarkets 89
surrounding 89
tourism 89
toys 89
visited 89
wireless 89
alumni 88
arrive 88
assumed 88
boca 88
bodies 88
brands 88
buried 88
carlos 88
chechnya 88
clock 88
collective 88
columbus 88
confrontation 88
counts 88
credits 88
deck 88
deny 88
desk 88
fan 88
frequently 88
graphs 88
julie 88
kerrigan 88
loyal 88
marry 88
missile 88
novelist 88
operate 88
plain 88
pleasure 88
praise 88
prompted 88
rap 88
recordings 88
reforms 88
resulted 88
saint 88
serbia 88
solomon 88
strauss 88
stunning 88
styles 88
superintendent 88
tend 88
vermont 88
aziz 87
burton 87
capacity 87
chechen 87
compiled 87
defending 87
dropping 87
filing 87
gore 87
honors 87
interactive 87
invasion 87
involvement 87
khmer 87
mason 87
messier 87
mistake 87
ninth 87
plunge 87
purchased 87
pure 87
reader 87
reposing 87
resigns 87
restoration 87
richmond 87
rochester 87
routine 87
saving 87
sessions 87
slain 87
tools 87
unique 87
wolf 87
ager 86
aging 86
agreements 86
altogether 86
battles 86
bridgeport 86
carrier 86
citizen 86
commercials 86
comprehensive 86
compromise 86
conviction 86
embassy 86
individuals 86
invest 86
junk 86
kaplan 86
meadowlands 86
pilots 86
posted 86
radiation 86
shall 86
slide 86
solid 86
sr 86
stayed 86
steady 86
straus 86
applied 85
attempts 85
aware 85
bowls 85
calm 85
centuries 85
chips 85
declining 85
detective 85
extension 85
extensive 85
floors 85
forgotten 85
formula 85
graphic 85
greenberg 85
katherine 85
lies 85
listening 85
maurice 85
nichols 85
realize 85
reverse 85
saul 85
sincere 85
strategies 85
string 85
suburb 85
tens 85
yellow 85
bidding 84
byrne 84
castro 84
celebrating 84
cellular 84
chances 84
chemicals 84
cocaine 84
columns 84
content 84
cruise 84
dartmouth 84
debra 84
exposed 84
featured 84
findings 84
franchise 84
friendly 84
generations 84
grounds 84
hilton 84
irene 84
lockout 84
marcus 84
mets 84
monitor 84
odd 84
olive 84
pamela 84
portfolio 84
reaches 84
robbery 84
shaped 84
skin 84
soldier 84
tested 84
throw 84
turner 84
achieved 83
amounts 83
architects 83
barred 83
borders 83
courage 83
czechoslovakia 83
damaged 83
depressed 83
detailed 83
du 83
eleanor 83
encourage 83
experiences 83
frame 83
guest 83
hampshire 83
iii 83
lauren 83
loses 83
mad 83
neighbor 83
outcome 83
pays 83
quarterly 83
reflected 83
reviewed 83
romantic 83
rowland 83
sections 83
sick 83
signing 83
smile 83
supporting 83
useful 83
viacom 83
warmth 83
weapon 83
andre 82
anita 82
argentina 82
background 82
beef 82
brutal 82
businessman 82
castle 82
coal 82
dates 82
delicate 82
destroyed 82
duties 82
eddie 82
fined 82
immigrant 82
impasse 82
importance 82
islands 82
kinds 82
kurt 82
leg 82
mae 82
negotiating 82
peak 82
peck 82
pending 82
pharmaceutical 82
possession 82
prof 82
questioned 82
recognized 82
regularly 82
replacement 82
respected 82
roughly 82
saddened 82
scoring 82
sen 82
storms 82
studied 82
township 82
traveled 82
victories 82
arbitration 81
assassination 81
atmosphere 81
attract 81
bellwether 81
boards 81
boxing 81
budgets 81
carefully 81
collections 81
contribution 81
creates 81
custody 81
danny 81
edwin 81
elevator 81
firefighters 81
fixed 81
handful 81
indoor 81
ivy 81
meals 81
midwest 81
negative 81
phil 81
postponed 81
precious 81
productions 81
psychology 81
rebecca 81
ridgewood 81
riding 81
romance 81
sexually 81
slaying 81
suburbs 81
typically 81
vikings 81
andrea 80
arrival 80
astoria 80
boxes 80
bullets 80
churches 80
comic 80
contrast 80
cooperation 80
couples 80
crashed 80
curb 80
detail 80
difficulties 80
documentary 80
emerge 80
essays 80
expenses 80
explosion 80
influential 80
instance 80
jacobs 80
jacqueline 80
jewelry 80
length 80
locker 80
luck 80
nomination 80
outdoor 80
parade 80
premier 80
rainbow 80
retreat 80
solve 80
soprano 80
studios 80
synagogue 80
tall 80
temperatures 80
tool 80
translated 80
trash 80
utah 80
yankee 80
absence 79
alvin 79
andrews 79
arabs 79
balloon 79
believes 79
cabaret 79
captured 79
cargo 79
challenging 79
communism 79
curtis 79
discovery 79
diseases 79
diversity 79
document 79
donna 79
dressed 79
edwards 79
ellis 79
fines 79
greg 79
guards 79
harpercollins 79
heaven 79
hewlett 79
indianapolis 79
lottery 79
merge 79
mining 79
mozart 79
newman 79
plunged 79
quest 79
quits 79
reed 79
retain 79
significantly 79
socialist 79
succeeded 79
surgeon 79
trinity 79
unknown 79
urge 79
victoria 79
wages 79
waterfront 79
yorker 79
applications 78
architectural 78
bancorp 78
bryant 78
choreographer 78
classroom 78
