like 4556
yeah 4381
got 3618
nigga 2706
know 2498
bitch 2394
ai 2344
fuck 2040
shit 1714
niggas 1647
love 1397
baby 1201
want 1156
money 1115
oh 1114
let 1097
gon 1080
wanna 1031
right 1029
girl 1023
ooh 882
need 881
time 839
tell 757
hit 753
uh 741
way 740
ass 718
man 700
bitches 685
lyrics 667
ayy 655
said 633
watch 604
ta 597
new 581
la 567
pussy 548
look 539
tryna 536
come 529
feel 520
real 501
hey 499
lil 493
good 482
ya 480
think 478
life 471
boy 446
ho 445
big 429
told 428
fuckin 420
hoes 416
pull 414
bad 409
gang 403
huh 392
cause 378
woo 373
yo 372
night 370
day 365
turn 363
mind 356
drop 354
da 350
god 343
leave 343
aye 335
pop 334
talk 334
ride 323
better 320
play 316
left 314
came 311
damn 311
face 309
hold 305
wo 301
walk 299
run 294
bag 289
hard 289
young 289
head 287
stop 284
shawty 279
high 278
na 274
everybody 273
bust 272
rich 272
little 269
okay 266
ah 260
dick 259
beat 250
woah 249
trap 248
black 247
til 244
party 242
hot 240
nah 240
skrrt 237
mama 235
stay 235
kill 233
check 232
gettin 232
talkin 232
lot 231
break 225
bring 225
change 221
whip 220
long 219
world 217
thing 215
cut 214
girls 212
body 211
type 211
dance 210
bop 207
fucked 206
gucci 206
straight 206
work 202
club 201
try 201
city 200
cash 199
act 197
swear 197
old 196
friends 195
mad 194
heart 192
broke 190
house 190
diamonds 189
white 189
live 187
different 185
die 183
hope 181
hop 180
lookin 180
hate 179
crazy 176
smoke 176
thought 175
fly 173
round 173
home 172
red 172
low 171
best 170
heard 169
throw 169
block 167
going 167
wrist 167
away 166
fucking 166
game 165
took 165
hands 164
ball 162
fast 162
molly 162
getting 160
mean 160
shoot 160
shots 160
feelin 159
ready 156
catch 153
ring 153
blow 152
hell 152
lean 152
hood 150
lie 150
ice 149
slow 149
teach 149
feeling 146
gas 146
bands 145
car 143
ha 143
shake 143
phone 142
find 141
pay 141
rock 140
dougie 139
times 139
care 138
rollie 137
taste 137
bang 136
freak 135
went 135
started 134
drip 133
g 133
k 133
twerk 133
bounce 132
d 132
eyes 132
gone 132
bank 131
believe 131
free 131
roll 131
gave 130
dope 129
wrong 128
ask 127
o 127
light 126
thick 126
brr 125
people 125
swerve 125
wait 125
woke 125
fight 124
things 124
racks 123
comin 122
miss 122
murder 122
pain 121
ballin 120
bought 119
eat 119
true 119
bet 118
drink 118
hatin 118
yes 118
boss 117
friend 117
m 117
poppin 117
plug 115
rain 115
trust 115
fall 114
flex 114
pass 114
remember 114
saying 114
gangsta 113
line 113
push 113
seen 113
alright 112
faded 112
keys 112
school 112
b 111
ay 110
chain 110
gold 110
hear 110
probably 109
cup 108
rose 108
runnin 108
tired 108
couple 107
town 107
floor 106
knock 106
gun 105
lose 105
somebody 105
trying 105
buy 104
cold 104
crack 104
dawg 104
dream 104
talking 104
drive 103
neck 102
start 102
wet 102
di 101
mouth 101
nae 100
slatt 100
sorry 100
rack 98
soul 98
tonight 98
fine 97
knew 97
sheck 97
street 97
walkin 97
coupe 96
rap 96
stupid 96
wild 95
dead 94
drippin 94
homie 94
inside 94
truth 94
shorty 93
touch 93
weed 93
guess 92
maybe 92
whoa 92
lay 91
playin 91
stand 91
t 91
blood 90
boys 90
hol 90
lost 90
slide 90
matter 89
smokin 88
cardi 87
dog 87
e 87
help 87
needed 87
spend 87
worried 87
bentley 86
foreign 86
minute 86
streets 86
vibe 86
foot 85
looking 85
shot 85
today 85
wanted 85
wish 85
bout 84
hustle 84
pedal 84
send 84
feelings 83
hair 83
hand 83
livin 83
lord 83
sit 83
team 83
thang 83
understand 83
cool 82
daddy 82
door 82
dumb 82
paper 82
pump 82
s 82
living 81
suck 81
booty 80
set 80
fake 79
fresh 79
million 79
motherfuckin 79
brain 78
brand 78
place 78
remix 78
ridin 78
wasted 78
em 77
road 77
tiimmy 77
water 77
word 77
london 76
outta 76
quiet 76
sippin 76
wes 76
worth 76
fire 75
meet 75
pole 75
coming 74
deep 74
hah 74
legs 74
monster 74
song 74
trippin 74
sauce 73
bit 72
caught 72
crib 72
goes 72
morning 72
problem 72
year 72
count 71
days 71
deal 71
pockets 71
thot 71
chick 70
drugs 70
pick 70
y 70
dab 69
hurt 69
kick 69
killin 69
paid 69
playing 69
pretty 69
quick 69
sayin 69
scared 69
sex 69
stick 69
tried 69
wit 69
yuh 69
bobby 68
chopper 68
clothes 68
eh 68
loco 68
week 68
case 67
clean 67
double 67
drank 67
flow 67
skrt 67
spot 67
air 66
music 66
open 66
super 66
aight 65
blue 65
designer 65
forever 65
glock 65
haters 65
listen 65
loud 65
makin 65
p 65
perfect 65
room 65
sound 65
business 64
finna 64
fool 64
reason 64
star 64
track 64
yellow 64
diamond 63
lit 63
pack 63
shmoney 63
smoking 63
benz 62
chains 62
cop 62
flocka 62
kiss 62
pray 62
thousand 62
feet 61
fell 61
homies 61
mm 61
nose 61
turnt 61
x 61
balling 60
crew 60
flip 60
outside 60
wake 60
wonder 60
callin 59
cry 59
fat 59
fleek 59
kids 59
killing 59
king 59
middle 59
porsche 59
shoes 59
thinkin 59
turned 59
workin 59
lady 58
mo 58
past 58
yah 58
end 57
ghost 57
sleep 57
tap 57
tellin 57
actin 56
bed 56
dollars 56
finally 56
hoe 56
louis 56
ran 56
running 56
woman 56
blah 55
bow 55
easy 55
jet 55
met 55
motherfucking 55
numb 55
pour 55
rari 55
treat 55
yea 55
bae 54
blessin 54
dat 54
family 54
grab 54
smile 54
speak 54
waste 54
west 54
women 54
blaow 53
blessed 53
bro 53
flexin 53
forget 53
hennessy 53
hundreds 53
jesus 53
jump 53
number 53
outchea 53
point 53
zone 53
boo 52
control 52
juice 52
making 52
soon 52
speed 52
swing 52
brrt 51
close 51
grind 51
main 51
squad 51
ceiling 50
green 50
half 50
key 50
late 50
pocket 50
quan 50
shirt 50
sick 50
strong 50
stuck 50
trappin 50
waka 50
blame 49
facts 49
famous 49
hoo 49
moving 49
ones 49
scene 49
step 49
thinking 49
blunt 48
cars 48
dig 48
dump 48
fa 48
lotta 48
loving 48
motherfucker 48
plate 48
scoop 48
shout 48
slayed 48
toes 48
zooted 48
bend 47
bleed 47
brick 47
doors 47
drunk 47
ex 47
fame 47
lights 47
ma 47
miami 47
nails 47
pants 47
problems 47
safe 47
shinin 47
sign 47
skr 47
swipe 47
text 47
winnin 47
wraith 47
beef 46
bugatti 46
codeine 46
fetti 46
finger 46
guys 46
l 46
peace 46
stack 46
stoner 46
sun 46
sure 46
switch 46
takin 46
ugh 46
use 46
wear 46
brother 45
dropped 45
fun 45
goddamn 45
guap 45
holy 45
jail 45
judge 45
lane 45
que 45
teeth 45
war 45
bags 44
bling 44
blowin 44
bruh 44
great 44
kinda 44
naked 44
rockin 44
bottles 43
dollar 43
found 43
killed 43
killers 43
leg 43
momma 43
read 43
savage 43
sip 43
son 43
state 43
studio 43
thank 43
titties 43
trick 43
bumpin 42
caliber 42
cocaine 42
cost 42
dancin 42
ee 42
fade 42
hang 42
kitchen 42
mmm 42
pills 42
saw 42
swag 42
taking 42
worry 42
bricks 41
bustin 41
clap 41
funny 41
gyal 41
hello 41
panda 41
pipe 41
police 41
private 41
pulled 41
seat 41
shootin 41
skrr 41
watching 41
win 41
bicken 40
blinded 40
cake 40
checks 40
chill 40
choice 40
deuce 40
dough 40
later 40
muh 40
phantom 40
press 40
prolly 40
promise 40
rest 40
riding 40
runner 40
single 40
sky 40
throwin 40
babe 39
bih 39
chest 39
feds 39
haha 39
hella 39
kind 39
kyrie 39
lame 39
lick 39
mmh 39
news 39
overnight 39
rob 39
rollin 39
seven 39
slim 39
spent 39
stank 39
style 39
bigger 38
brought 38
c 38
cartier 38
coco 38
deserve 38
hide 38
knows 38
ladies 38
li 38
movie 38
num 38
oakland 38
pictures 38
price 38
regular 38
sheesh 38
shine 38
telling 38
trump 38
years 38
bills 37
breathe 37
cheese 37
death 37
donald 37
drinkin 37
drug 37
flame 37
hookah 37
liquor 37
losin 37
mornin 37
owe 37
pew 37
power 37
shut 37
thotiana 37
thug 37
versace 37
birthday 36
champagne 36
champion 36
chippi 36
choppa 36
cross 36
dirty 36
dj 36
dude 36
ground 36
happy 36
person 36
picture 36
respect 36
screamin 36
sittin 36
south 36
ways 36
words 36
account 35
attitude 35
burn 35
camera 35
chance 35
clip 35
dress 35
duff 35
esskeetit 35
fill 35
furnace 35
handle 35
pimp 35
steady 35
stylist 35
summer 35
tight 35
truck 35
yup 35
arms 34
dreams 34
far 34
figure 34
fore 34
french 34
gotti 34
heat 34
kid 34
luck 34
mil 34
nasty 34
pistol 34
rolls 34
sell 34
skateboard 34
spin 34
chyeah 33
dark 33
dip 33
finish 33
git 33
grip 33
hopped 33
mothafuckin 33
nice 33
og 33
post 33
quarter 33
rolling 33
sleepin 33
slime 33
store 33
sweet 33
tear 33
tryin 33
watchin 33
anybody 32
arm 32
asked 32
askin 32
automatic 32
beam 32
bullets 32
bullshit 32
busy 32
called 32
chanel 32
countin 32
dash 32
died 32
dlow 32
doo 32
focused 32
grindin 32
kept 32
movin 32
print 32
proud 32
roof 32
row 32
sad 32
sing 32
smell 32
spit 32
trip 32
wrapped 32
york 32
bite 31
born 31
bread 31
cops 31
daughter 31
doctor 31
dying 31
early 31
fact 31
future 31
h 31
hating 31
lately 31
load 31
locs 31
macarena 31
meant 31
mercy 31
piece 31
pot 31
rider 31
rip 31
rocking 31
space 31
sumn 31
thirty 31
v 31
alive 30
bored 30
felt 30
games 30
guns 30
hungry 30
jeans 30
kodak 30
lock 30
looked 30
maría 30
moves 30
nope 30
ok 30
shower 30
thoughts 30
throwing 30
touchdown 30
twerkin 30
wow 30
attention 29
bomb 29
brown 29
bunch 29
burner 29
college 29
cute 29
dancer 29
dee 29
drum 29
feed 29
givin 29
glamorous 29
henny 29
hunnid 29
job 29
lamborghini 29
learn 29
lies 29
necklace 29
ocho 29
pose 29
sack 29
save 29
steal 29
suicidal 29
thirsty 29
ticket 29
waist 29
waiting 29
wiggle 29
wildin 29
yung 29
ahh 28
boom 28
bottle 28
cap 28
droppin 28
f 28
girlfriend 28
harder 28
horse 28
known 28
lips 28
popped 28
rapper 28
retarded 28
season 28
selling 28
slippin 28
songs 28
supposed 28
tears 28
threw 28
wallet 28
whippin 28
acting 27
afford 27
andalay 27
atlanta 27
bool 27
booth 27
bullet 27
chances 27
clique 27
cook 27
fo 27
glad 27
haan 27
hangin 27
imagine 27
inch 27
insane 27
knees 27
lemon 27
mall 27
maybach 27
mix 27
ouu 27
ow 27
period 27
plane 27
pound 27
prove 27
pullin 27
rappin 27
record 27
slaughter 27
small 27
u 27
uhh 27
waitin 27
birkin 26
blew 26
bound 26
box 26
chicken 26
clear 26
comes 26
eatin 26
flash 26
follow 26
glass 26
happen 26
killer 26
lambo 26
learned 26
lemonade 26
locked 26
missing 26
moment 26
mud 26
offset 26
partner 26
pinky 26
sellin 26
shooters 26
singing 26
skrilla 26
smash 26
stress 26
strip 26
tec 26
till 26
toe 26
vibes 26
wave 26
weight 26
window 26
wipe 26
calling 25
ching 25
cinco 25
corner 25
country 25
dime 25
drown 25
earth 25
father 25
favorite 25
fendi 25
forgive 25
giving 25
grow 25
grown 25
happened 25
hater 25
hip 25
hola 25
honey 25
instagram 25
jewelry 25
jungle 25
match 25
message 25
nother 25
opp 25
plan 25
queen 25
rappers 25
ringin 25
rings 25
roxanne 25
rules 25
sister 25
soda 25
soundin 25
stars 25
turner 25
upset 25
walked 25
wife 25
working 25
z 25
beats 24
bodies 24
book 24
chop 24
class 24
clown 24
cookin 24
fah 24
feels 24
freeze 24
hittin 24
iced 24
icy 24
instead 24
jordan 24
khaled 24
leavin 24
mac 24
means 24
milli 24
mirror 24
mom 24
paint 24
player 24
plus 24
quit 24
raw 24
stanky 24
uber 24
usually 24
wheel 24
answer 23
attached 23
baow 23
boat 23
bone 23
building 23
calls 23
cat 23
changed 23
closed 23
commas 23
cuz 23
dogs 23
drinking 23
faith 23
fashion 23
fear 23
flexing 23
forgot 23
gram 23
grandma 23
happening 23
hmm 23
jaw 23
jealous 23
joke 23
kobe 23
league 23
loose 23
magic 23
mercedes 23
mission 23
popping 23
prada 23
rounds 23
screaming 23
signed 23
sold 23
tempo 23
tip 23
toast 23
tomorrow 23
twice 23
twin 23
action 22
ambitions 22
band 22
bar 22
blueface 22
bucks 22
chillin 22
court 22
crash 22
crip 22
date 22
devil 22
dinner 22
don 22
dub 22
everyday 22
eye 22
land 22
link 22
list 22
lyin 22
merengue 22
mother 22
mudboy 22
notice 22
opps 22
pair 22
park 22
patek 22
ratchet 22
rice 22
sight 22
sugar 22
sunday 22
swimmin 22
vision 22
walking 22
wishin 22
angels 21
ap 21
ba 21
belt 21
brews 21
brothers 21
bury 21
cards 21
chase 21
chika 21
church 21
dolla 21
dreaming 21
drownin 21
ear 21
extra 21
fallin 21
fam 21
field 21
fit 21
flossy 21
food 21
fraud 21
hat 21
honest 21
jumpin 21
lanes 21
pink 21
radar 21
sak 21
scream 21
second 21
sexy 21
ship 21
skinny 21
slum 21
sock 21
stacks 21
swervin 21
trigger 21
w 21
worse 21
write 21
wrote 21
ysl 21
beep 20
bird 20
blessings 20
blind 20
blowing 20
bye 20
cali 20
california 20
coke 20
cousin 20
curve 20
doubt 20
drama 20
east 20
el 20
fault 20
favors 20
flick 20
flippin 20
having 20
heaven 20
hills 20
hug 20
lifestyle 20
lockin 20
lonely 20
mi 20
montana 20
pa 20
packs 20
paris 20
phones 20
questions 20
realest 20
rocks 20
rockstar 20
shop 20
shows 20
slums 20
socks 20
solve 20
split 20
swish 20
tape 20
te 20
toss 20
tote 20
trouble 20
twerkulator 20
verse 20
weak 20
ace 19
admit 19
america 19
baddest 19
beast 19
broad 19
choose 19
choppers 19
cooking 19
counting 19
delicious 19
dem 19
fans 19
flyin 19
friday 19
geeked 19
gets 19
golden 19
guy 19
holdin 19
hollywood 19
hottest 19
jackson 19
kissin 19
makes 19
married 19
mess 19
mothafucka 19
mula 19
pardon 19
pickin 19
pill 19
pool 19
pressure 19
race 19
rooster 19
saint 19
selfish 19
shotta 19
signs 19
sir 19
spray 19
stash 19
stomach 19
strapped 19
sweat 19
taught 19
thugger 19
trunk 19
trusting 19
tssh 19
ugly 19
vip 19
wall 19
wrap 19
ape 18
bah 18
bankroll 18
bean 18
bougie 18
breath 18
buck 18
bulgin 18
bum 18
card 18
chainz 18
chasin 18
child 18
cuban 18
cum 18
dancing 18
dirt 18
eating 18
expensive 18
fabo 18
finished 18
folks 18
grand 18
heavy 18
hi 18
houston 18
jack 18
laurent 18
lemons 18
level 18
lo 18
menace 18
millions 18
milly 18
mustard 18
note 18
platinum 18
played 18
pourin 18
prayin 18
pretend 18
pure 18
reach 18
rep 18
revved 18
santa 18
saturday 18
shoulda 18
skin 18
slave 18
steak 18
story 18
stripper 18
struggle 18
tag 18
tall 18
throat 18
thuggin 18
tokyo 18
tripping 18
tv 18
weather 18
wedding 18
addict 17
addicts 17
afraid 17
ago 17
basic 17
bay 17
beautiful 17
bein 17
beware 17
blunts 17
brrr 17
bus 17
butter 17
crank 17
creepin 17
curse 17
dawgs 17
demon 17
demons 17
dot 17
dressed 17
eighty 17
fair 17
fan 17
flock 17
foo 17
freaky 17
freezer 17
froze 17
grade 17
guantanamera 17
happens 17
hero 17
higher 17
hole 17
hoppin 17
imma 17
independent 17
internet 17
jerk 17
jumped 17
kush 17
lames 17
laugh 17
lawyer 17
lover 17
milf 17
mixed 17
moly 17
monday 17
naw 17
nervous 17
nina 17
older 17
plenty 17
poor 17
profit 17
question 17
raised 17
rod 17
semi 17
short 17
shoulder 17
showed 17
shuffle 17
silentó 17
slang 17
southside 17
squeeze 17
stackin 17
standards 17
stomp 17
stove 17
strings 17
suckin 17
surprise 17
swisha 17
tasty 17
thumbing 17
tool 17
tweet 17
um 17
wop 17
alert 16
angel 16
babies 16
bakin 16
balenciaga 16
boyfriend 16
brains 16
butt 16
chair 16
click 16
cookie 16
crowd 16
cryin 16
cuff 16
davy 16
draco 16
faces 16
figures 16
fish 16
fix 16
flight 16
fold 16
freestyle 16
gift 16
grammy 16
greatest 16
hahaha 16
halloween 16
heels 16
hour 16
hurry 16
jiggy 16
john 16
kitty 16
knife 16
knockin 16
lake 16
le 16
limit 16
loot 16
mattress 16
michael 16
misunderstood 16
mixtape 16
mop 16
mothafuckas 16
ni 16
nigo 16
panties 16
parted 16
parties 16
passed 16
pin 16
posted 16
poured 16
pow 16
purple 16
puttin 16
r 16
raise 16
range 16
rick 16
route 16
royce 16
rush 16
salute 16
scary 16
seein 16
shoe 16
showin 16
smooth 16
sneak 16
soft 16
speakin 16
stoppin 16
strap 16
switchin 16
texas 16
thighs 16
thou 16
trees 16
triple 16
upgrade 16
whores 16
witness 16
worst 16
xans 16
aim 15
ak 15
ali 15
bando 15
beach 15
blast 15
bonjour 15
breaking 15
broads 15
bunny 15
cater 15
charge 15
children 15
coast 15
credit 15
crown 15
de 15
difference 15
diss 15
dive 15
dry 15
envy 15
exes 15
fergie 15
ferrari 15
flag 15
flood 15
focus 15
frame 15
glow 15
gosh 15
grr 15
habit 15
heartbeat 15
influence 15
jacket 15
jigga 15
jimmy 15
jobs 15
kai 15
keepin 15
là 15
laid 15
large 15
legend 15
lemme 15
likeembed 15
madame 15
mane 15
medicine 15
metro 15
missin 15
moon 15
near 15
noise 15
ohh 15
overseas 15
pase 15
pint 15
po 15
public 15
rent 15
rolled 15
rubber 15
satellites 15
seats 15
sent 15
shoutout 15
showers 15
sipping 15
slap 15
snitch 15
stage 15
standing 15
stressin 15
stuff 15
test 15
tie 15
tippy 15
titty 15
tone 15
tongue 15
traffic 15
trenches 15
voice 15
weave 15
weekend 15
wings 15
woop 15
woulda 15
ye 15
aid 14
anymore 14
argue 14
assim 14
bangin 14
bardi 14
barely 14
bars 14
becky 14
bi 14
bill 14
bleeding 14
blocks 14
bopping 14
boule 14
bright 14
broken 14
cómo 14
caroline 14
carti 14
catching 14
cocky 14
conversation 14
correct 14
crashed 14
darling 14
dial 14
distant 14
dm 14
driving 14
dummy 14
enemies 14
excuse 14
fakin 14
fed 14
flying 14
gifted 14
hammer 14
headed 14
hill 14
hittas 14
holes 14
hooh 14
humble 14
hype 14
important 14
j 14
jane 14
konnichiwa 14
leanin 14
lesson 14
lords 14
loved 14
loyal 14
mắn 14
mansion 14
map 14
metal 14
mic 14
mike 14
model 14
motherfuckers 14
movies 14
n 14
nicki 14
nights 14
nike 14
north 14
paparazzi 14
perc 14
pollie 14
projects 14
puff 14
ross 14
rover 14
score 14
sean 14
section 14
shade 14
shmurda 14
shopping 14
sides 14
sin 14
sitting 14
solid 14
spanish 14
spinnin 14
stones 14
stunt 14
table 14
tay 14
tea 14
thots 14
turning 14
wan 14
wayne 14
windows 14
yee 14
yg 14
youngin 14
zig 14
add 13
anthem 13
billy 13
booted 13
bossy 13
bottoms 13
bridge 13
careful 13
carpet 13
chasing 13
cheap 13
cheated 13
chris 13
clout 13
coat 13
color 13
dad 13
dealing 13
dolce 13
estás 13
fifth 13
flat 13
flew 13
flooded 13
fur 13
gates 13
gimme 13
glocks 13
goose 13
grams 13
grill 13
jam 13
jugg 13
kanye 13
kool 13
law 13
linen 13
listening 13
louboutin 13
missed 13
mode 13
nuts 13
ooouuu 13
pac 13
plain 13
pro 13
reverse 13
richer 13
rrrah 13
rude 13
rumors 13
self 13
sense 13
shoppin 13
shoulders 13
silly 13
sixteen 13
size 13
slidin 13
soy 13
spice 13
stressed 13
stuntin 13
tatted 13
trapping 13
trill 13
vacation 13
vegas 13
wetter 13
whips 13
wood 13
yard 13
zip 13
age 12
answers 12
apart 12
ashamed 12
ate 12
average 12
banana 12
beans 12
bestie 12
bike 12
bless 12
blessing 12
boolin 12
boppin 12
brag 12
breakfast 12
bringing 12
brooklyn 12
bucket 12
burnin 12
cell 12
ceo 12
chips 12
clappin 12
code 12
comfortable 12
condom 12
couch 12
coulda 12
cream 12
daily 12
dangerous 12
dipped 12
dissin 12
drake 12
drivin 12
ease 12
en 12
ended 12
energy 12
ev 12
fergalicious 12
gabbana 12
gangster 12
ginóbili 12
glizzy 12
history 12
holding 12
hours 12
james 12
juggin 12
lead 12
lied 12
lunch 12
mail 12
major 12
mexico 12
mile 12
mood 12
mwah 12
neighbors 12
notch 12
nowadays 12
obsession 12
papi 12
peep 12
pero 12
piss 12
plottin 12
praying 12
pre 12
pregnant 12
pride 12
q 12
relate 12
replace 12
represent 12
rid 12
rims 12
rodeo 12
roles 12
romp 12
says 12
se 12
seater 12
shame 12
shining 12
skeet 12
snake 12
snakes 12
snatch 12
snatched 12
solo 12
special 12
spendin 12
static 12
stayed 12
stone 12
stripes 12
suicide 12
surprised 12
swallow 12
takes 12
tee 12
thomas 12
thursday 12
toot 12
tour 12
trash 12
turnin 12
vem 12
vroom 12
vvs 12
watches 12
welcome 12
wobble 12
zombiie 12
actavis 11
addy 11
advice 11
ahead 11
anthony 11
balenciagas 11
ben 11
biggie 11
birds 11
blazin 11
boulevard 11
bra 11
bump 11
buyin 11
cappin 11
carry 11
ch 11
choke 11
claim 11
clips 11
copped 11
crossed 11
dare 11
david 11
decide 11
dice 11
disrespect 11
donut 11
drrrat 11
dun 11
easier 11
ecstasy 11
es 11
extended 11
facetime 11
fail 11
falling 11
fancy 11
fiend 11
fingers 11
flop 11
foul 11
garage 11
ghetto 11
gnashin 11
goals 11
gossip 11
hanging 11
happenin 11
hearin 11
hits 11
hotter 11
keeps 11
kemo 11
lamb 11
licks 11
lone 11
looks 11
losing 11
lottery 11
luke 11
lust 11
mala 11
mami 11
mans 11
martin 11
maserati 11
matte 11
meal 11
meat 11
meetin 11
mention 11
milk 11
mob 11
month 11
motherfuck 11
named 11
needs 11
nerd 11
nicotine 11
nut 11
option 11
patience 11
planet 11
polo 11
preach 11
prison 11
pushin 11
radio 11
reel 11
rhyme 11
salad 11
scope 11
scratch 11
scum 11
sendin 11
serve 11
service 11
shady 11
sheets 11
sinner 11
skip 11
slaves 11
slice 11
smack 11
snap 11
snow 11
spaceship 11
speaking 11
sporty 11
sprinter 11
sprite 11
staring 11
stepping 11
steps 11
sticks 11
strippers 11
stuffed 11
stunting 11
substance 11
superstar 11
syrup 11
system 11
tech 11
textin 11
thangs 11
title 11
tools 11
tooth 11
tuesday 11
uncle 11
ups 11
venus 11
voy 11
wanting 11
wearin 11
weepin 11
wham 11
wifey 11
wig 11
wine 11
addicted 10
address 10
album 10
anh 10
art 10
ayo 10
balls 10
bape 10
basement 10
bass 10
battle 10
bent 10
blank 10
bowl 10
buckle 10
buildin 10
bummer 10
bussin 10
cam 10
cameras 10
celebrate 10
chateau 10
cheeks 10
chicago 10
closer 10
cologne 10
concert 10
course 10
cover 10
cups 10
curry 10
cuts 10
danny 10
dawn 10
deposit 10
digits 10
drums 10
dudes 10
dyke 10
escape 10
ferg 10
fountain 10
frontin 10
fu 10
givenchy 10
grew 10
grinding 10
groupie 10
hobby 10
hotel 10
human 10
icky 10
ignorin 10
iii 10
jay 10
juicy 10
kẻ 10
keeping 10
kevin 10
kicked 10
kickin 10
knob 10
knowin 10
label 10
layin 10
leash 10
leather 10
leaves 10
legit 10
lined 10
lived 10
loaded 10
lobby 10
lolo 10
lovers 10
loyalty 10
lucky 10
magi 10
malibu 10
mamacita 10
mask 10
meek 10
men 10
mhm 10
moanin 10
mountain 10
neutron 10
như 10
normal 10
numbers 10
order 10
partners 10
pat 10
peons 10
pissed 10
plays 10
poison 10
pokin 10
prince 10
proceed 10
purse 10
quarterback 10
rah 10
rat 10
rise 10
rocky 10
rolex 10
rookie 10
safety 10
satan 10
seeing 10
shades 10
shh 10
shits 10
sho 10
shooter 10
silento 10
sink 10
slangin 10
slept 10
smith 10
sneaks 10
sola 10
soulja 10
steppin 10
success 10
superman 10
surrounded 10
swerving 10
swim 10
swishers 10
swole 10
teacher 10
tecca 10
thalia 10
thunder 10
ting 10
tinted 10
touched 10
travel 10
tu 10
tune 10
tunechi 10
twenties 10
uno 10
và 10
view 10
vv 10
wassup 10
whitney 10
wiped 10
wishing 10
worldwide 10
yacht 10
yay 10
yep 10
youngboy 10
al 9
applause 9
audi 9
babylon 9
baguettes 9
baller 9
barbarian 9
barbed 9
beatin 9
betcha 9
bimmer 9
bloaw 9
boogie 9
boosie 9
boots 9
bother 9
bounced 9
brake 9
bull 9
burnt 9
button 9
buying 9
byrie 9
candy 9
casa 9
chat 9
chi 9
christian 9
christmas 9
circle 9
clumsy 9
clutchin 9
coffin 9
columbiana 9
company 9
coochie 9
crippin 9
cutie 9
damage 9
decisions 9
degrees 9
dej 9
drawers 9
dread 9
drinks 9
duck 9
dues 9
dust 9
dyin 9
eater 9
emotions 9
enjoy 9
evil 9
exclusive 9
feature 9
fellas 9
fiends 9
fightin 9
fighting 9
filled 9
flanders 9
flyest 9
folk 9
fuego 9
glue 9
gorillas 9
government 9
grass 9
grave 9
grimy 9
grove 9
guala 9
gym 9
ham 9
hm 9
holler 9
homicide 9
hopin 9
hurts 9
hustling 9
iggin 9
ignore 9
ill 9
industry 9
inglewood 9
jamaica 9
jean 9
jewels 9
kidneys 9
kilo 9
knowing 9
laughin 9
leaving 9
likely 9
lines 9
liver 9
longer 9
lungs 9
manners 9
marc 9
meaning 9
migo 9
mileage 9
mill 9
millionaire 9
models 9
moms 9
months 9
moonrocks 9
moonwalking 9
mulsanne 9
murda 9
muscle 9
ned 9
nonsense 9
ocean 9
oven 9
pecan 9
pen 9
penitentiary 9
philly 9
places 9
plastic 9
porch 9
proof 9
pulling 9
putting 9
remy 9
ricky 9
riverdale 9
robbed 9
rough 9
rule 9
scouts 9
searchin 9
seasons 9
security 9
shocked 9
shorter 9
silence 9
sins 9
slick 9
slip 9
smart 9
smoove 9
sniff 9
sober 9
spirits 9
spittin 9
spread 9
stab 9
stare 9
starin 9
storm 9
stretch 9
suit 9
tank 9
tats 9
throne 9
tony 9
train 9
treated 9
trial 9
tunnel 9
tw 9
visit 9
voices 9
wakin 9
walker 9
weapon 9
wednesday 9
whipping 9
wind 9
winner 9
wire 9
wishes 9
yi 9
adore 8
amazing 8
amen 8
apologize 8
army 8
asking 8
asshole 8
aw 8
bananas 8
belong 8
biggest 8
blicky 8
bloods 8
boi 8
bombs 8
bows 8
brazy 8
breathin 8
bros 8
bruce 8
bully 8
burning 8
butterfly 8
calliope 8
calm 8
caution 8
center 8
certain 8
charlie 8
chauffeur 8
cherry 8
chose 8
chuck 8
clock 8
cloud 8
competition 8
confused 8
contact 8
conversate 8
covered 8
creep 8
crush 8
curb 8
curious 8
daytrip 8
dealer 8
dedicated 8
desire 8
detroit 8
disappear 8
disguise 8
divine 8
dolphin 8
dr 8
driver 8
eagle 8
ears 8
elephant 8
espn 8
everytime 8
fanta 8
faster 8
felons 8
fifties 8
finesse 8
finessin 8
flames 8
flapping 8
flavor 8
flesh 8
forth 8
fox 8
freaks 8
fucks 8
fully 8
gambino 8
gobble 8
goons 8
grammys 8
grippin 8
groove 8
gta 8
guarantee 8
guwop 8
haaan 8
halos 8
helicopter 8
highway 8
hitting 8
honda 8
hook 8
hoping 8
hustlin 8
irrelevant 8
issues 8
jamaican 8
jammer 8
jammin 8
jumping 8
karate 8
keisha 8
ki 8
kicks 8
kissing 8
knee 8
knowledge 8
lace 8
lackin 8
limelight 8
lip 8
listenin 8
lives 8
los 8
lots 8
lowkey 8
luôn 8
lying 8
maintain 8
makeup 8
mark 8
mars 8
mary 8
math 8
melt 8
memories 8
mental 8
mink 8
minnesota 8
minutes 8
mommy 8
motion 8
moved 8
nada 8
nat 8
nle 8
ooooo 8
options 8
oui 8
pan 8
parked 8
parts 8
payroll 8
personalities 8
petty 8
plans 8
popstar 8
posed 8
praise 8
privacy 8
proper 8
puerto 8
quiero 8
racist 8
randy 8
ray 8
reasons 8
reckless 8
redfoo 8
regret 8
remind 8
rihanna 8
risk 8
robbin 8
rocket 8
rosé 8
roscoe 8
rowdy 8
rub 8
ruger 8
runway 8
russia 8
sacrifice 8
sally 8
salon 8
salt 8
sand 8
shape 8
share 8
shhh 8
silent 8
simple 8
sinkin 8
skirt 8
sleeve 8
spirit 8
splashin 8
steel 8
stephen 8
stepped 8
stimulated 8
stopped 8
stopping 8
sucking 8
surface 8
survive 8
tan 8
tennis 8
thicker 8
thinks 8
thottie 8
ti 8
tint 8
tits 8
toby 8
tragic 8
tres 8
tucked 8
tweakin 8
umm 8
una 8
understood 8
valley 8
vicious 8
visa 8
vote 8
wana 8
wants 8
watched 8
whacked 8
wheels 8
whipped 8
wreck 8
xan 8
yule 8
actually 7
ad 7
advance 7
angles 7
anti 7
apple 7
appreciate 7
arrest 7
asleep 7
assume 7
attract 7
bake 7
bark 7
bear 7
beauty 7
benihana 7
bentayga 7
blocka 7
blu 7
bom 7
boring 7
boujee 7
build 7
built 7
busting 7
cage 7
camp 7
cases 7
cha 7
challenge 7
changin 7
changing 7
cheat 7
cheating 7
checkin 7
checking 7
chicks 7
chief 7
chills 7
choo 7
choosin 7
choosing 7
classic 7
classy 7
closet 7
clouds 7
clyde 7
colors 7
como 7
complain 7
complainin 7
concrete 7
copy 7
created 7
cruise 7
cubes 7
cuffin 7
dale 7
dallas 7
danger 7
dealin 7
deck 7
decline 7
demeanor 7
dennis 7
dese 7
diddy 7
diet 7
distance 7
doe 7
draft 7
dripped 7
dripping 7
dubai 7
earned 7
earrings 7
ego 7
ends 7
english 7
expect 7
extendo 7
extras 7
fades 7
faz 7
features 7
fee 7
finding 7
fixed 7
flavored 7
foenem 7
forecast 7
forest 7
fours 7
fragrance 7
frozen 7
fumble 7
gear 7
generation 7
glover 7
goodbye 7
google 7
grabbed 7
groovy 7
group 7
grra 7
grrah 7
guitar 7
haa 7
haitians 7
hated 7
heal 7
health 7
hearts 7
heebiejeebies 7
held 7
holla 7
homeboy 7
honestly 7
horny 7
iana 7
illest 7
image 7
invite 7
involved 7
iphone 7
iron 7
island 7
islands 7
jeep 7
jets 7
jiggas 7
jt 7
keith 7
knocked 7
knot 7
knots 7
lại 7
lack 7
lap 7
lavish 7
lawyers 7
lear 7
licky 7
lighting 7
lingo 7
lipstick 7
listened 7
lobster 7
lupe 7
luxury 7
manager 7
matrix 7
mayne 7
memphis 7
mississippi 7
monique 7
ms 7
này 7
nba 7
nerves 7
newton 7
nikki 7
orange 7
outfit 7
painted 7
panamera 7
panic 7
parking 7
passin 7
passport 7
patrick 7
peeling 7
penny 7
penthouse 7
pepper 7
percocet 7
percosex 7
pieces 7
pillow 7
pimpin 7
pimping 7
pistols 7
playa 7
playboy 7
polka 7
posh 7
potential 7
pounds 7
pouring 7
pressed 7
project 7
psycho 7
rags 7
rainbow 7
rapping 7
rare 7
records 7
redbone 7
redlyfe 7
reefer 7
regrets 7
religion 7
repeat 7
rewind 7
sace 7
sat 7
scale 7
scammers 7
screw 7
sea 7
secret 7
shadows 7
shakin 7
shaking 7
sharks 7
shooting 7
shy 7
silicone 7
simply 7
sk 7
slowly 7
smashin 7
social 7
sofa 7
soldier 7
spare 7
spazzin 7
species 7
spending 7
spiderman 7
spinning 7
standin 7
steve 7
stolen 7
strange 7
sub 7
sucker 7
sunny 7
sweater 7
tables 7
tantrum 7
tattoo 7
texts 7
thief 7
thin 7
thotty 7
threat 7
threesome 7
throwed 7
timin 7
timmy 7
toilet 7
tom 7
tommy 7
tough 7
trapper 7
tree 7
trey 7
tricking 7
twist 7
twitter 7
unforgettable 7
untouchable 7
venice 7
verses 7
video 7
vikings 7
visas 7
walls 7
wash 7
wearing 7
weird 7
whatchu 7
whoop 7
widow 7
winter 7
witcha 7
wock 7
worker 7
yeezy 7
yesterday 7
zonin 7
accept 6
adidas 6
aimin 6
alcohol 6
alley 6
andalé 6
annoying 6
artist 6
asian 6
aston 6
attend 6
auntie 6
ave 6
awake 6
awards 6
backed 6
backend 6
backpack 6
backwards 6
backwood 6
badass 6
balmain 6
balmains 6
ban 6
barbie 6
base 6
beamer 6
beating 6
beg 6
bell 6
belly 6
bentleys 6
beyoncé 6
bikini 6
blaze 6
bleedin 6
bloody 6
bonnie 6
booked 6
brakes 6
breezy 6
bubblegum 6
budget 6
bug 6
buzz 6
còn 6
calories 6
canada 6
captain 6
cared 6
charges 6
charm 6
checked 6
chevy 6
chew 6
chewed 6
chit 6
chocolate 6
chorus 6
christ 6
chubby 6
climb 6
cnn 6
coach 6
committed 6
conscience 6
contigo 6
corners 6
counted 6
county 6
cried 6
crime 6
criminal 6
crying 6
custom 6
cuttin 6
dapper 6
dates 6
denim 6
devils 6
dicks 6
digger 6
dis 6
dome 6
doubted 6
dracos 6
dreads 6
dressin 6
driveway 6
dro 6
drummers 6
dubs 6
dumpster 6
dutch 6
edge 6
elevator 6
ending 6
engine 6
equal 6
erase 6
err 6
eve 6
eventful 6
exactly 6
exhale 6
eyebrows 6
fate 6
feast 6
fever 6
figg 6
figured 6
film 6
finessed 6
flights 6
float 6
flyer 6
ford 6
foreigns 6
fortune 6
forward 6
france 6
freedom 6
friendly 6
fuckers 6
fye 6
gain 6
gate 6
gay 6
geekin 6
georgia 6
giuseppe 6
globe 6
gloves 6
goin 6
goofy 6
gorgeous 6
graduated 6
grain 6
grandpa 6
greece 6
grippy 6
gunna 6
guts 6
gutter 6
hall 6
hallelujah 6
handouts 6
handstands 6
heads 6
heel 6
hips 6
hitter 6
holds 6
hollow 6
ig 6
iggy 6
interest 6
intro 6
jag 6
jason 6
joint 6
july 6
juvy 6
ka 6
keef 6
kelly 6
khaleesi 6
killas 6
kilos 6
kio 6
kirko 6
ky 6
laced 6
language 6
leap 6
lease 6
lebron 6
leech 6
legends 6
lessons 6
lifeguard 6
location 6
locksmith 6
lyfe 6
một 6
mafia 6
maison 6
margiela 6
marry 6
master 6
matchin 6
mayor 6
meals 6
melly 6
memory 6
mentally 6
millis 6
mines 6
misses 6
misused 6
moments 6
monte 6
morphine 6
mumblin 6
muthafucking 6
mvp 6
nas 6
nate 6
neighborhood 6
nem 6
net 6
nickel 6
nig 6
nonstop 6
noticed 6
nt 6
office 6
ounce 6
ovo 6
package 6
painting 6
parents 6
passion 6
pastor 6
patient 6
pause 6
paying 6
penetratin 6
percs 6
perky 6
phew 6
photo 6
photos 6
pic 6
pie 6
pilot 6
planes 6
plot 6
poke 6
poker 6
popular 6
por 6
position 6
president 6
presidential 6
princess 6
promises 6
pumps 6
punch 6
queens 6
rag 6
ralph 6
rats 6
recognize 6
ref 6
relaxing 6
remain 6
reply 6
reporting 6
respond 6
revolvers 6
reyup 6
riches 6
righteous 6
robin 6
role 6
rollies 6
rope 6
rot 6
sadness 6
scandalous 6
seal 6
searching 6
serena 6
settle 6
sexual 6
shark 6
shed 6
shell 6
shittin 6
shockin 6
shook 6
showing 6
sicker 6
singin 6
sis 6
situation 6
skinned 6
skrrr 6
skype 6
slipped 6
slut 6
smarter 6
smilin 6
smoked 6
snappin 6
sniper 6
solar 6
sorrow 6
speakers 6
spill 6
spine 6
sports 6
starts 6
status 6
stayin 6
stealin 6
stiff 6
stole 6
stressing 6
su 6
sucked 6
suge 6
suite 6
sweatin 6
swinging 6
switching 6
taken 6
tang 6
tat 6
tattoos 6
teachers 6
tease 6
telly 6
tempt 6
tense 6
texting 6
thrash 6
thugga 6
thugs 6
tick 6
tiger 6
tighten 6
timeless 6
tippin 6
tips 6
topic 6
toxic 6
traumatized 6
tru 6
turns 6
twistin 6
ultralight 6
uzi 6
vacay 6
valentine 6
vercetti 6
version 6
vibin 6
videos 6
violence 6
wack 6
wavy 6
wax 6
weeks 6
wesson 6
wide 6
winning 6
wore 6
worked 6
wrists 6
yards 6
yatted 6
yawk 6
yawning 6
yeet 6
yellin 6
youngins 6
youtube 6
zero 6
zombie 6
đường 5
aah 5
acres 5
adderall 5
afro 5
agree 5
aka 5
alarm 5
alexander 5
alllll 5
ankles 5
anxiety 5
appeal 5
aquafina 5
ar 5
arguing 5
arrested 5
assholes 5
attack 5
attic 5
audemars 5
avoid 5
aware 5
bên 5
bước 5
backbone 5
bail 5
balloons 5
bans 5
based 5
basically 5
bath 5
biatch 5
bible 5
bid 5
billies 5
birdie 5
bitin 5
bitty 5
blatt 5
blockin 5
blurry 5
bm 5
boop 5
boot 5
boricua 5
borin 5
bosses 5
braggin 5
breed 5
bridges 5
bringin 5
brush 5
bs 5
bubba 5
bubble 5
bubbly 5
buddha 5
buddy 5
burned 5
burr 5
busta 5
có 5
cancún 5
candle 5
casket 5
caused 5
ceilin 5
cellular 5
certified 5
chapo 5
chariot 5
charts 5
cheddar 5
cheek 5
chewy 5
childish 5
chinchilla 5
chiraq 5
chopsticks 5
chronic 5
cigarettes 5
cities 5
clarity 5
closest 5
cloth 5
clutch 5
cock 5
cockpit 5
coldest 5
collar 5
collard 5
comma 5
compromise 5
condo 5
connect 5
consider 5
convo 5
coupes 5
crackin 5
craft 5
creeping 5
cuddle 5
dangerously 5
dap 5
dc 5
dealership 5
deals 5
dear 5
definition 5
deliver 5
depends 5
desert 5
destroy 5
ding 5
dinners 5
dish 5
doll 5
dom 5
dots 5
doubled 5
dre 5
drill 5
dropping 5
drove 5
drowning 5
duckin 5
duffel 5
dunk 5
effect 5
embed 5
emotionally 5
enter 5
exact 5
excited 5
exciting 5
exotic 5
explain 5
extendos 5
faucet 5
fazed 5
female 5
fiction 5
fights 5
flavors 5
flo 5
flops 5
florida 5
flows 5
follies 5
followers 5
following 5
foods 5
foreplay 5
formal 5
fries 5
frisbee 5
fronted 5
gat 5
george 5
given 5
glitter 5
glory 5
gmail 5
goal 5
greens 5
grits 5
grizz 5
growing 5
grrt 5
guest 5
guidance 5
guilty 5
hammers 5
heartless 5
hehe 5
hiding 5
hoodie 5
hooked 5
hopping 5
horn 5
horsepower 5
horses 5
hunnids 5
imperfection 5
inches 5
indians 5
inhale 5
ironic 5
janey 5
jenner 5
jocking 5
joe 5
johnny 5
join 5
jon 5
jordans 5
journey 5
karma 5
không 5
kidney 5
killa 5
kisses 5
kite 5
labels 5
landing 5
latest 5
laughing 5
lauren 5
lauryn 5
laws 5
laying 5
leaf 5
leaned 5
lee 5
legendary 5
lifesaver 5
likes 5
limits 5
lion 5
liter 5
literally 5
litty 5
loaf 5
loan 5
loc 5
local 5
logo 5
longest 5
loser 5
loss 5
louder 5
lounge 5
lyricsi 5
ménage 5
madman 5
malcolm 5
marathon 5
marie 5
marijuana 5
marks 5
marvin 5
mcqueen 5
member 5
merry 5
messy 5
meyou 5
midas 5
migos 5
minds 5
mistakes 5
mitch 5
mixin 5
mobbin 5
monkey 5
moscato 5
mouths 5
mozart 5
names 5
nation 5
naughty 5
nearly 5
nelson 5
nick 5
nipsey 5
nissan 5
non 5
notes 5
nova 5
od 5
odds 5
ogs 5
oil 5
omen 5
onyx 5
ooo 5
oooh 5
oscar 5
overdosed 5
packed 5
palm 5
panty 5
paraguay 5
paranoia 5
parkin 5
passenger 5
pauls 5
payin 5
payment 5
peach 5
peanut 5
perform 5
pg 5
phase 5
philippe 5
phony 5
physically 5
pile 5
pitching 5
pity 5
plaques 5
plead 5
pops 5
porn 5
porsches 5
powder 5
practice 5
prayed 5
prayer 5
present 5
presidents 5
prime 5
pudding 5
purp 5
purses 5
pushing 5
pussies 5
quicker 5
races 5
racin 5
raf 5
rainy 5
realize 5
related 5
relax 5
rental 5
repping 5
rerock 5
reverend 5
rican 5
richard 5
rico 5
ridiculous 5
riot 5
roarin 5
roller 5
rovers 5
ruler 5
sẽ 5
saints 5
sales 5
saved 5
schemin 5
scorin 5
screen 5
search 5
sentence 5
serenity 5
sh 5
shells 5
shift 5
shock 5
simons 5
sisters 5
skipped 5
slapped 5
sleeping 5
sleeves 5
sloppy 5
smiles 5
sneakers 5
sonic 5
sorta 5
southwest 5
spades 5
sparkin 5
speedin 5
spitting 5
splash 5
spoiled 5
spoke 5
stamina 5
stinking 5
straps 5
strength 5
struggles 5
styrofoam 5
survoler 5
swagger 5
swagging 5
tú 5
tab 5
tame 5
target 5
thong 5
thumb 5
timeline 5
tissue 5
ton 5
toolie 5
topless 5
totin 5
touchin 5
tracks 5
trance 5
trips 5
truancy 5
trucks 5
turbo 5
twisted 5
unknown 5
upper 5
uptown 5
van 5
vans 5
vault 5
veces 5
veins 5
vent 5
vet 5
victim 5
vida 5
virgin 5
vogue 5
vuitton 5
waitress 5
wap 5
warn 5
wasting 5
waters 5
waves 5
web 5
weezy 5
wept 5
westin 5
westside 5
whoo 5
whore 5
willy 5
wished 5
wonderin 5
wondering 5
worthwhile 5
wrongs 5
xanny 5
yao 5
yeahyou 5
yell 5
zest 5
